{
    "metadata": {
        "subject": "Biochemistry",
        "abbreviation": "BCHE",
        "common": [
            "biochem",
            "bchem"
        ]
    },
    "courses": {
        "140": {
            "name": "Introduction to Biochemistry",
            "credits": "1 Credit (1)",
            "description": "A description of the nature of inquiry in biochemistry, especially with respect to the interaction of chemistry and biology. Both historical development and topics of current interest will be discussed. Graded S/U.",
            "link": null,
            "taughtWith": null
        },
        "241": {
            "name": "Introduction to Research in Biochemistry",
            "credits": "1-3 Credits",
            "description": "Techniques and procedures of biochemical research.  May be repeated for a maximum of 3 credits.",
            "link": null,
            "taughtWith": null
        },
        "341": {
            "name": "Survey of Biochemistry",
            "credits": "4 Credits (3+3P)",
            "description": "Basic principles of biochemical processes and the structure/function of the major classes of biomolecules, with introductions to metabolism and the central dogma of biochemistry. The chemical and biological properties of major biomolecules (DNA, proteins, May be repeated up to 4 credits. ",
            "link": null,
            "taughtWith": null
        },
        "395": {
            "name": "Biochemistry I",
            "credits": "3 Credits (3)",
            "description": "Principles governing chemistry and physics of life processes with emphasis on the relationships between molecular structure and cell function.  Basic principles of biochemical processes, enzymology, and the structure/function of the major classes of biomolecules with introductions to metabolism.  Introduction to catabolic metabolism.  ",
            "link": null,
            "taughtWith": null
        },
        "396": {
            "name": "Biochemistry II Honors",
            "credits": "3 Credits (3)",
            "description": "Taught with BCHE396 with additional work required. ",
            "link": null,
            "taughtWith": 396
        },
        "424": {
            "name": "Experimental Biochemistry I",
            "credits": "3 Credits (1.25+6P)",
            "description": "Laboratory techniques required for experimentation with recombinant DNA such as nucleic acid isolation and purification, polymerase chain reaction (PCR), sequence analysis, and directed mutagenesis using genetic material from both prokaryotic and eukaryotic organisms. ",
            "link": null,
            "taughtWith": null
        },
        "425": {
            "name": "Experimental Biochemistry II",
            "credits": "3 Credits (3)",
            "description": "Introduction to fundamental techniques used to explore structure and function of biological macromolecules such as proteins, carbohydrates, lipids, and nucleic acid. Course covers analyzing and reporting experimental data; enzymology; quantitative methods to determine biological molecules; basic principles of electrophoresis, chromatography, and spectroscopic immunochemistry. May be repeated up to 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "432": {
            "name": "Physical Biochemistry",
            "credits": "3 Credits (3)",
            "description": "This course focuses on modern Biophysical techniques used in protein and nucleic acid research. Topics are covered in some detail at the theoretical level. The course content is delivered entirely by podcast. Podcast contributions are from several different faculty from within their particular area(s) of expertise. Topics covered include (but are not limited to): biomolecular NMR, atomic force microscopy, light scattering, circular dichroism, ultracentrifugation, isothermal titration calorimetry, positron emission tomography, computerized tomography, ultrasound, functional MRI, protein fluorescence, mass spec/ proteomics, protein molecular dynamics simulations, and X-ray diffraction. Course credit qualifies for minor degree in chemistry as a physical-analytical chemistry emphasis.   CHEM431, or CHEM433.",
            "link": null,
            "taughtWith": null
        },
        "440": {
            "name": "Biochemistry Seminar",
            "credits": "1 Credit (1)",
            "description": "Introduction to current literature in biochemistry and molecular biology. Selected topics in the field will be presented by the faculty. Students will present written and oral reports from literature searches.   Restricted to: BCHE majors. ",
            "link": null,
            "taughtWith": null
        },
        "441": {
            "name": "Advanced Research in Biochemistry",
            "credits": "1-3 Credits",
            "description": "Investigation of biochemical problems and the development of special techniques.  May be repeated for a maximum of 3 credits.",
            "link": null,
            "taughtWith": null
        },
        "451": {
            "name": "Special Topics",
            "credits": "1-3 Credits",
            "description": "Same as CHEM451.  May be repeated for a maximum of 12 credits.",
            "link": null,
            "taughtWith": null
        },
        "455": {
            "name": "Independent Studies",
            "credits": "1-3 Credits",
            "description": "Independent studies directed by consulting faculty. ",
            "link": null,
            "taughtWith": null
        },
        "540": {
            "name": "Seminar in Biochemistry",
            "credits": "1 Credit (1)",
            "description": "Formal seminar presentation in current topics in biochemical research. May be repeated for a maximum of 3 credits.",
            "link": null,
            "taughtWith": null
        },
        "542": {
            "name": "Biochemistry I",
            "credits": "3 Credits (3)",
            "description": "Relationship between macromolecular structure and function. Basic enzymology. Energy metabolism.  ",
            "link": null,
            "taughtWith": null
        },
        "545": {
            "name": "Molecular and Biochemical Genetics",
            "credits": "3 Credits (3)",
            "description": "An accelerated treatment of the molecular basis of gene expression. Discussion of chemical, enzymological, and genetic techniques of molecular biology.  Same as BIOL 545.",
            "link": null,
            "taughtWith": null
        },
        "546": {
            "name": "Biochemistry II",
            "credits": "3 Credits (3)",
            "description": "Intermediary metabolism: catabolic and anabolic pathways of carbohydrates, lipids, amino acids, and nucleic acids, including their regulation. ",
            "link": null,
            "taughtWith": null
        },
        "590": {
            "name": "Discussions in Biochemistry",
            "credits": "1 Credit (1)",
            "description": "Current research problems in biochemistry. May be repeated for a maximum of 6 credits.  Graded: S/U Grading (S/U, Audit).",
            "link": null,
            "taughtWith": null
        },
        "598": {
            "name": "Special Research Programs",
            "credits": "1-3 Credits",
            "description": "May be repeated for a maximum of 6 credits. Same as CHEM598. Graded S/U.",
            "link": null,
            "taughtWith": null
        },
        "599": {
            "name": "Master's Thesis",
            "credits": "15 Credits",
            "description": "May be repeated for a maximum of 6 credits. Same as CHEM599.",
            "link": null,
            "taughtWith": null
        },
        "600": {
            "name": "Research",
            "credits": "1-15 Credits",
            "description": "May be repeated for a maximum of 20 credits. PR/U grading. Same as CHEM600.",
            "link": null,
            "taughtWith": null
        },
        "647": {
            "name": "Physical Biochemistry",
            "credits": "3 Credits (3)",
            "description": "Fundamental applications of physical chemistry to the investigation of biological metabolites and biological macromolecules, including proteins, oligo-nucleotides, and molecular arrays with an emphasis on understanding biological functions based on chemical structures.  ",
            "link": 451,
            "taughtWith": null
        },
        "649": {
            "name": "Topics in Biochemistry",
            "credits": "1-3 Credits",
            "description": "Selected topics of current interest designated by title and credit. May be repeated for a maximum of 3 credits.",
            "link": null,
            "taughtWith": null
        },
        "650": {
            "name": "Advanced Seminar",
            "credits": "1 Credit (1)",
            "description": "Discussion of biochemical research in progress that relates to a doctoral candidate's thesis research.  Intended for students who have earned a master's degree or the equivalent and has made significant research progress for preparation of the doctoral dissertation.  May be repeated for a maximum of 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "700": {
            "name": "Doctoral Dissertation",
            "credits": "20 Credits",
            "description": "May be repeated for a maximum of 20 credits. Graded PR/U. Same as CHEM700.",
            "link": null,
            "taughtWith": null
        }
    }
}