{
    "metadata": {
        "subject": "Computer Science",
        "abbreviation": "CS",
        "common": [
            "compsci",
            "computersci",
            "computerscience"
        ]
    },
    "courses": {
        "111": {
            "name": "Computer Science Principles",
            "credits": "4 Credits (3+2P)",
            "description": "This course provides a broad and exciting introduction to the field of computer science and the impact that computation has today on every aspect of life. It focuses on exploring computing as a creative activity and investigates the key foundations of computing: abstraction, data, algorithms, and programming. It looks into how connectivity and the Internet have revolutionized computing and demonstrates the global impact that computing has achieved, and it reveals how a new student in computer science might become part of the computing future. ",
            "link": null,
            "taughtWith": null
        },
        "117": {
            "name": "Introduction to Computer Animation",
            "credits": "3 Credits (3)",
            "description": "Introductory course for learning to program with computer animation as well as learning basic concepts in computer science. Students create interactive animation projects such as computer games and learn to use software packages for creating animations in small virtual worlds using 3D models. Recommended for students considering a minor/major in computer science or simply interested in beginning computer animation or programming.",
            "link": null,
            "taughtWith": null
        },
        "151": {
            "name": "C++ Programming",
            "credits": "3 Credits (2+2P)",
            "description": "Introduction to object-oriented programming in the C++ language. The focus will be on preparing students to use C++ in their own areas. No prior programming experience is required.   ",
            "link": null,
            "taughtWith": 451
        },
        "152": {
            "name": "Java Programming",
            "credits": "3 Credits (2+2P)",
            "description": "Programming in the Java language. May be repeated up to 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "153": {
            "name": "Python Programming I",
            "credits": "3 Credits (3)",
            "description": "This course is an introduction to programming in the Python language, covering fundamental scripts, data types and variables, functions, and simple object creation and usage. The focus will be on preparing students to use Python in their own areas. No prior programming experience is required.   ",
            "link": null,
            "taughtWith": 453
        },
        "154": {
            "name": "Python Programming II",
            "credits": "3 Credits (3)",
            "description": "This course covers advanced Python programming, including classes, objects, and inheritance, embedded programming in domain applications, database interaction, and advanced data and text processing. The focus will be on preparing students to use Python in their own areas.  ",
            "link": null,
            "taughtWith": null
        },
        "157": {
            "name": "Topics in Software Programming and Applications",
            "credits": "3 Credits (2+2P)",
            "description": "Current topics in computer programming and software applications. Topic announced in the Schedule of Classes. May be repeated if subtitle is different.",
            "link": null,
            "taughtWith": null
        },
        "158": {
            "name": "R Programming I",
            "credits": "3 Credits (3)",
            "description": "This course is an introduction to data processing in the R language, covering fundamental script configuration, data types and data collections, R control structures, and basic creation of graphs and data visualizations. This course will not focus on the statistical capabilities of R, though some basic statistical computations will be used. ",
            "link": null,
            "taughtWith": null
        },
        "171": {
            "name": "Introduction to Computer Science",
            "credits": "4 Credits (3+2P)",
            "description": "Computers are now used widely in all area of modern life. This course provides understanding of the theoretical and practical foundations for how computers work, and provides practical application and programming experience in using computers to solve problems efficiently and effectively. The course covers broad aspects of the hardware, software, and mathematical basis of computers. Weekly labs stress using computers to investigate and report on data-intensive scientific problems. Practical experience in major software applications includes an introduction to programming, word processing, spreadsheets, databases, presentations, and Internet applications. ",
            "link": null,
            "taughtWith": null
        },
        "172": {
            "name": "Computer Science I",
            "credits": "4 Credits (3+2P)",
            "description": "Computational problem solving; problem analysis; implementation of algorithms using Java. Object-oriented concepts, arrays, searching, sorting, and recursion. Taught with CS460 ",
            "link": null,
            "taughtWith": 460
        },
        "209": {
            "name": "Special Topics.",
            "credits": "1-3 Credits",
            "description": "May be repeated for a maximum of 12 credits.",
            "link": null,
            "taughtWith": null
        },
        "271": {
            "name": "Object Oriented Programming",
            "credits": "4 Credits (3+2P)",
            "description": "Introduction to problem analysis and problem solving in the object-oriented paradigm. Practical introduction to implementing solutions in the C++ language. Pointers and dynamic memory allocation. Hands-on experience with useful development tools.   ",
            "link": null,
            "taughtWith": 462
        },
        "272": {
            "name": "Introduction to Data Structures",
            "credits": "4 Credits (3+2P)",
            "description": "Design, implementation, use of fundamental abstract data types and their algorithms: lists, stacks, queues, deques, trees; imperative and declarative programming. Internal sorting; time and space efficiency of algorithms.   ",
            "link": null,
            "taughtWith": 463
        },
        "273": {
            "name": "Machine Programming and Organization",
            "credits": "4 Credits (3+2P)",
            "description": "Computer structure, instruction execution, addressing techniques; programming in machine and assembly languages.   ",
            "link": null,
            "taughtWith": 464
        },
        "278": {
            "name": "Discrete Mathematics for Computer Science",
            "credits": "4 Credits (3+2P)",
            "description": "Discrete mathematics required for Computer Science, including the basics of logic, number theory, methods of proof, sequences, mathematical induction, set theory, counting, and functions.   ",
            "link": null,
            "taughtWith": 465
        },
        "343": {
            "name": "Algorithm Design &amp; Implementation",
            "credits": "3 Credits (3)",
            "description": "Introduction to efficient data structure and algorithm design. Basic graph algorithms. Balanced search trees. Classic algorithm design paradigms: divide-and-conquer, greedy scheme, and dynamic programming.  ",
            "link": null,
            "taughtWith": 493
        },
        "370": {
            "name": "Compilers and Automata Theory",
            "credits": "4 Credits (3+2P)",
            "description": "Methods, principles, and tools for programming language processor design; basics of formal language theory (finite automata, regular expressions, context-free grammars); development of compiler components.   ",
            "link": null,
            "taughtWith": 466
        },
        "371": {
            "name": "Software Development",
            "credits": "4 Credits (3+2P)",
            "description": "Software specification, design, testing, maintenance, documentation; informal proof methods; team implementation of a large project.  ",
            "link": null,
            "taughtWith": 468
        },
        "372": {
            "name": "Data Structures and Algorithms",
            "credits": "4 Credits (3+2P)",
            "description": "Introduction to efficient data structure and algorithm design. Order notation and asymptotic run-time of algorithms. Recurrence relations and solutions.  Abstract data type dynamic set and red-black trees. Classic algorithm design paradigms: divide-and-conquer, dynamic programming, greedy algorithms.  ",
            "link": null,
            "taughtWith": 469
        },
        "380": {
            "name": "Introduction to Cryptography",
            "credits": "3 Credits (3)",
            "description": "The course covers basic cryptographic primitives, such as symmetric, public-key ciphers, digital signature schemes, and hash functions, and their mathematical underpinnings. Course helps students understand basic notions of security in a cryptographic sense: chosen plaintext and chosen ciphertext attacks, games, and reductions. Course also covers computational number theory relevant to cryptography. Consent of Instructor required.  ",
            "link": null,
            "taughtWith": 525
        },
        "382": {
            "name": "Modern Web Technologies",
            "credits": "3 Credits (3)",
            "description": "In this course, we will take a full-stack approach to modern web application design. We will start with the fundamentals including HTML5, CSS3, Javascript, JSON, and the underlying networking concepts and protocols driving the modern web. We will then move on to more advanced topics including javascript backend development with Node.js, NoSQL database design with MongoDB, cloud computing, and re-sponsive web design. Finally, we cover advanced topics including the design and im- plementation of browser extensions and real-time web technologies like WebRTC and WebSockets. Consent of Instructor required. ",
            "link": null,
            "taughtWith": 532
        },
        "409": {
            "name": "Independent Study",
            "credits": "1-6 Credits (1-6)",
            "description": "Faculty supervised investigation, to culminate in a written report.  May be repeated up to 6 credits.  ",
            "link": null,
            "taughtWith": null
        },
        "419": {
            "name": "Computing Ethics and Social Implications of Computing",
            "credits": "1 Credit (1)",
            "description": "An overview of ethics for computing majors includes: history of computing, intellectual property, privacy, ethical frameworks, professional ethical responsibilities, and risks of computer-based systems. ",
            "link": null,
            "taughtWith": null
        },
        "448": {
            "name": "Senior Project",
            "credits": "4 Credits (4)",
            "description": "Capstone course in which C S majors work in teams and apply computer science skills to complete a large project. Restricted to: C S majors.  ",
            "link": null,
            "taughtWith": null
        },
        "449": {
            "name": "Senior Thesis",
            "credits": "4 Credits (4)",
            "description": "Capstone course in which C S majors apply computer science skills to complete a research project, culminating in a written thesis report. Restricted to: C S majors.  ",
            "link": null,
            "taughtWith": null
        },
        "451": {
            "name": "C++ Programming",
            "credits": "3 Credits (3)",
            "description": "Programming in the C language.  Required more advanced graduate work than CS151. Recommended for nonmajors only. Not for CS undergraduate students.",
            "link": 151,
            "taughtWith": null
        },
        "452": {
            "name": "Java Programming",
            "credits": "3 Credits (2+2P)",
            "description": "Programming in the Java language. More advanced than CS152. Recommended for nonmajors only. Not for CS undergraduate standing. May be repeated up to 3 credits.",
            "link": null,
            "taughtWith": null
        },
        "453": {
            "name": "Python Programming I",
            "credits": "3 Credits (3)",
            "description": "This course is an introduction to programming in the Python language, covering fundamental scripts, data types and variables, functions, and simple object creation and usage. The focus will be on preparing students to use Python in their own areas. No prior programming experience is required.  More advanced than CS153.",
            "link": 153,
            "taughtWith": null
        },
        "454": {
            "name": "Python Programming II",
            "credits": "3 Credits (3)",
            "description": "This course covers advanced Python programming, including classes, objects, and inheritance, embedded programming in domain applications, database interaction, and advanced data and text processing. The focus will be on preparing students to use Python in their own areas. For graduate students only. Has more advanced work than CS154, and does not count towards CS major requirements. Not for CS undergraduate students. May be repeated up to 3 credits.  Restricted to: exclude C S majors.",
            "link": null,
            "taughtWith": null
        },
        "457": {
            "name": "Topics in Software Programming and Applications",
            "credits": "3 Credits (2+2P)",
            "description": "Current topics in computer programming and software applications. Topic announced in the Schedule of Classes. More advanced than CS157. recommended for non-majors only. May be repeated if subtitle is different. ",
            "link": null,
            "taughtWith": null
        },
        "458": {
            "name": "R Programming I",
            "credits": "3 Credits (3)",
            "description": "This course is an introduction to data processing in the R language, covering fundamental script configuration, data types and data collections, R control structures, and basic creation of graphs and data visualizations. This course will not focus on the statistical capabilities of R, though some basic statistical computations will be used. For graduate students only. Has more advanced work than CS158. Does not count towards CS major requirements.  May be repeated up to 3 credits.  ",
            "link": null,
            "taughtWith": null
        },
        "460": {
            "name": "Computer Science I Transition",
            "credits": "3 Credits (3)",
            "description": "Computational problem solving; problem analysis; implementation of algorithms. Recursive structures and algorithms. For C S graduate students only; cannot be used to meet a C S student's program of study. ",
            "link": 172,
            "taughtWith": null
        },
        "462": {
            "name": "Object Oriented Programming Transition",
            "credits": "3 Credits (3)",
            "description": "Introduction to problem analysis and problem solving in the object-oriented paradigm. Practical introduction to implementing solutions in the C++ language. Hands-on experience with useful development tools. Cannot be used in a C S student's program of study.  Consent of Instructor required.   ",
            "link": 271,
            "taughtWith": null
        },
        "463": {
            "name": "Introduction to Data Structures Transition",
            "credits": "3 Credits (3)",
            "description": "Design, implementation, use of fundamental abstract data types and their algorithms: lists, stacks, queues, deques, trees; imperative and declarative programming. Internal sorting; time and space efficiency of algorithms. Cannot be used in a C S student's program of study.  Consent of Instructor required.   ",
            "link": 272,
            "taughtWith": null
        },
        "464": {
            "name": "Machine Programming and Organization Transition",
            "credits": "3 Credits (3)",
            "description": "Computer structure, instruction execution, addressing techniques; programming in machine and assembly languages. Cannot be used in a C S student's program of study.  Consent of Instructor required.   ",
            "link": 273,
            "taughtWith": null
        },
        "465": {
            "name": "Discrete Math for Computer Science Transition",
            "credits": "3 Credits (3)",
            "description": "Logical connectives, sets, functions, relations, graphics, trees, proofs, induction, and application to computer science. For C S graduate students only. Cannot be used in a C S student's program of study.  Consent of Instructor required.   ",
            "link": 278,
            "taughtWith": null
        },
        "466": {
            "name": "Compilers and Automata Transition",
            "credits": "3 Credits (3)",
            "description": "Methods, principles, and tools for programming language processor design; basics of formal language theory (finite automata, regular expressions, context-free grammars); development of compiler components. For C S graduate students only; cannot be used in a students program of study.   ",
            "link": 370,
            "taughtWith": null
        },
        "468": {
            "name": "Software Development Transition",
            "credits": "3 Credits (3)",
            "description": "Software specification, design, testing, maintenance, documentation; informal proof methods; team implementation of a large project. For C S graduate students only. Cannot be used in a C S student's program of study.  Consent of Instructor required.   ",
            "link": 371,
            "taughtWith": null
        },
        "469": {
            "name": "Data Structure and Algorithms Transition",
            "credits": "3 Credits (3)",
            "description": "Introduction to efficient data structure and algorithm design. Order notation and asymptotic run-time of  algorithms. Recurrence relations and solutions. Abstract data type dynamic set and red-black trees. Classic algorithm design paradigms: divide-and-conquer, dynamic programming, greedy algorithms. For C S graduate students only. Consent of Instructor required.   ",
            "link": 372,
            "taughtWith": null
        },
        "471": {
            "name": "Programming Language Structure I",
            "credits": "3 Credits (3)",
            "description": "Syntax, semantics, implementation, and application of programming languages; abstract data types; concurrency. Not for C S graduate students.  ",
            "link": null,
            "taughtWith": null
        },
        "473": {
            "name": "Architectural Concepts I",
            "credits": "3 Credits (3)",
            "description": "Comparison of architectures to illustrate concepts of computer organization; relationships between architectural and software features. Not for C S graduate students.  ",
            "link": null,
            "taughtWith": null
        },
        "474": {
            "name": "Operating Systems I",
            "credits": "3 Credits (3)",
            "description": "Operating system principles and structures, and interactions with architectures. Not for C S graduate students.  ",
            "link": null,
            "taughtWith": null
        },
        "475": {
            "name": "Artificial Intelligence I",
            "credits": "3 Credits (3)",
            "description": "Fundamental principles and techniques in artificial intelligence systems. Intelligent Agents; solving problems by searching; local search techniques; game-playing agents; constraint satisfaction problems; knowledge representation and reasoning. Further selected topics may also be covered. Not for C S graduate students.   ",
            "link": null,
            "taughtWith": 505
        },
        "476": {
            "name": "Computer Graphics I",
            "credits": "3 Credits (3)",
            "description": "Languages, programming, devices, and data structures for representation and interactive display of complex objects. Not for C S graduate students. Taught  with CS506.  ",
            "link": null,
            "taughtWith": null
        },
        "477": {
            "name": "Digital Game Design",
            "credits": "3 Credits (3)",
            "description": "An introduction to digital game design. Topics include design, development, and playtesting of games. The course is structured to use team-based learning. Not for C S graduate students.   ",
            "link": null,
            "taughtWith": 517
        },
        "478": {
            "name": "Computer Security",
            "credits": "3 Credits (3)",
            "description": "Introduction to the art and science of computer security. Fundamentals of computer security including elementary cryptography, authentication and access control, security threats, attacks, detection and prevention in application software, operating systems, networks and databases. Not for C S graduate students.   ",
            "link": null,
            "taughtWith": 513
        },
        "479": {
            "name": "Special Topics",
            "credits": "1-12 Credits",
            "description": "Topics announced in the Schedule of Classes. May be repeated under different subtitles. Not for C S graduate students.     May be repeated up to 12 credits. ",
            "link": null,
            "taughtWith": null
        },
        "480": {
            "name": "Linux System Administration",
            "credits": "3 Credits (3)",
            "description": "Basic system administration for Linux environments. Topics include user managements, file systems, security, backups, system monitoring, kernel configuration and other relevant aspects of system administration. Not for Computer Science graduate students.",
            "link": null,
            "taughtWith": null
        },
        "481": {
            "name": "Visual Programming",
            "credits": "3 Credits (3)",
            "description": "Design and implementation of programs using visual (i.e. dataflow or diagrammatic) programming techniques, with an emphasis on real-time data processing. Students will learn how to design visual programs, including how to handle cycles and state maintenance, and will learn to process audio, video, and other data using visual programs. Not for C S graduate students.   ",
            "link": null,
            "taughtWith": 518
        },
        "482": {
            "name": "Database Management Systems I",
            "credits": "3 Credits (3)",
            "description": "Database design and implementation; models of database management systems; privacy, security, protection, recovery. Not for C S graduate students.   ",
            "link": null,
            "taughtWith": 502
        },
        "483": {
            "name": "Introduction to Robotics",
            "credits": "3 Credits (3)",
            "description": "Basic AI-based robotic architecture and concepts, with an emphasis on building and programming mobile robots. Not for C S graduate students.     ",
            "link": null,
            "taughtWith": 503
        },
        "484": {
            "name": "Computer Networks I",
            "credits": "3 Credits (3)",
            "description": "Fundamental concepts of computer communication networks: layered network architecture, network components, protocol stack and service. Example of application, transport, network and data link layers, protocols primarily drawn from the Internet (TCP, UDP, and IP) protocol multimedia networks; network management and security. Not for C S graduate students.     ",
            "link": null,
            "taughtWith": 504
        },
        "485": {
            "name": "Human-Centered Computing",
            "credits": "3 Credits (3)",
            "description": "Covers iterative, human-centered interface design, including prototyping and evaluation. Basics of graphic design and visualization. Not for C S graduate students.    ",
            "link": null,
            "taughtWith": 515
        },
        "486": {
            "name": "Bioinformatics",
            "credits": "3 Credits (3)",
            "description": "Introduction to bioinformatics and computational biology. Computational approaches to sequences analysis, protein structure prediction and analysis, and selected topics from current advances in bioinformatics. Not for C S graduate students.  ",
            "link": null,
            "taughtWith": 516
        },
        "487": {
            "name": "Applied Machine Learning I",
            "credits": "3 Credits (3)",
            "description": "An introductory course on practical machine learning. An overview of concepts for both unsupervised and supervised learning. Topics include classification, regression, clustering, and dimension reduction. Classical methods and algorithms such as linear regression, neural networks, support vector machines, and ensemble approaches. Recent techniques such as deep learning. Focused on applying of machine learning techniques in application domains. Not for Graduate Majors.  ",
            "link": null,
            "taughtWith": 519
        },
        "488": {
            "name": "Introduction to Data Mining",
            "credits": "3 Credits (3)",
            "description": "Techniques for exploring large data sets and discovering patterns in them. Data mining concepts, metrics to measure its effectiveness. Methods in classification, clustering, frequent pattern analysis. Selected topics from current advances in data mining.   ",
            "link": null,
            "taughtWith": 508
        },
        "489": {
            "name": "Bioinformatics Programming",
            "credits": "3 Credits (3)",
            "description": "Computer programming to analyze high-throughput molecular biology data including genomic sequences, bulk and single-cell transcriptome, epigenome, and other omics data. Quality control, library size normalization, confounding effect removal, clustering, statistical modeling, trajectory inference, and visualization.  May be repeated up to 3 credits.",
            "link": null,
            "taughtWith": 509
        },
        "491": {
            "name": "Parallel Programming",
            "credits": "3 Credits (3)",
            "description": "Programming of shared memory and distributed memory machines; tools and languages for parallel programming; techniques for parallel programming; parallel programming environments. Not for C S graduate students.   ",
            "link": null,
            "taughtWith": 521
        },
        "493": {
            "name": "Algorithm Design and Implementation",
            "credits": "3 Credits (3)",
            "description": "This course introduces the basic knowledge of designing classical algorithms and implementing these algorithms using a programming language. In particular, the course teaches various data structures, including graphs and balanced binary search trees, and efficient schemes to implement these data structures. This course also teaches basic algorithm design techniques including divide-and-conquer, greedy scheme, and dynamic programming. This course covers graph algorithms, including graph traversals (depth-first search and breadth-first search), connectivity, shortest paths, and minimum spanning trees. Graduate standing. Not for CS students.   ",
            "link": 343,
            "taughtWith": null
        },
        "494": {
            "name": "Introduction to Smart Grids",
            "credits": "3 Credits (3)",
            "description": "This course is an introduction to the technologies and design strategies associated with the Smart Grid. The emphasis will be on the development of communications, energy delivery, coordination mechanisms, and management tools to monitor transmission and distribution networks. Topics include: Smart grid introduction and evolution; Power systems; Networking and transport control; Artificial intelligence &amp; agent coordination; Data mining for smart grids.   ",
            "link": null,
            "taughtWith": 514
        },
        "496": {
            "name": "Cloud and Edge Computing",
            "credits": "3 Credits (3)",
            "description": "The course presents a top-down view of cloud computing, from applications and administration to programming and infrastructure. Its main focus is on the concepts of networking and parallel programming for cloud computing and large scale distributed systems which form the cloud infrastructure. The topics include: overview of cloud computing, cloud systems, parallel processing in the cloud, distributed storage systems, virtualization, security in the cloud, and multicore operating systems. Students will study state-of-the-art approaches to cloud computing followed by large cloud corporations, namely Google, Amazon, Microsoft, and Yahoo. Students will also apply what they learn through project developments using Amazon Web Services. Not for graduate CS majors.    ",
            "link": null,
            "taughtWith": 522
        },
        "502": {
            "name": "Database Management Systems I",
            "credits": "3 Credits (3)",
            "description": "Database design and implementation; models of database management systems; privacy, security, protection, recovery; taught with CS482; requires more advanced graduate work than CS482. Students are expected to have solid knowledge of data structures and discrete mathematics.",
            "link": 482,
            "taughtWith": null
        },
        "503": {
            "name": "Introduction to Robotics",
            "credits": "3 Credits (3)",
            "description": "Basic AI-based robotic architectures and concepts, with an emphasis on building and programming mobile robots; taught with CS483; requires more advanced graduate work than CS483. Students are expected to have solid knowledge of data structures and machine-level programming.",
            "link": 483,
            "taughtWith": null
        },
        "504": {
            "name": "Computer Networks I",
            "credits": "3 Credits (3)",
            "description": "Fundamental concepts of computer communication networks: layered network architecture, network components, protocol stack and service. Example of application, transport, network and data link layers, protocols primarily drawn from the Internet (TCP, UDP, and IP) protocol suite; local and wide area networks, wireless and mobile networks, multimedia networks; network management and security; taught with CS484; requires more advanced graduate work than CS484. Students are expected to have solid knowledge of data structures, machine-level programming. Knowledge of statistics (at the level of MATH 371 or MATH 470) is recommended.",
            "link": 484,
            "taughtWith": null
        },
        "505": {
            "name": "Artificial Intelligence I",
            "credits": "3 Credits (3)",
            "description": "Fundamental principles and techniques in artificial intelligence systems. Knowledge representation formalisms; heuristic problem solving techniques; automated logical deduction; robot planning methods; algorithmic techniques for natural language understanding, vision and learning; taught with CS475; requires more advanced graduate work than CS475. Students are expected to have strong knowledge of algorithms and data structures (at the level of CS372).",
            "link": 475,
            "taughtWith": null
        },
        "506": {
            "name": "Computer Graphics I",
            "credits": "3 Credits (3)",
            "description": "Languages, programming, devices, and data structures for representation and interactive display of complex objects.  Requires more advanced graduate work than CS476. Students are expected to have knowledge of compilers design and software engineering equivalent to CS370 and CS371.",
            "link": 476,
            "taughtWith": null
        },
        "508": {
            "name": "Introduction to Data Mining",
            "credits": "3 Credits (3)",
            "description": "Techniques for exploring large data sets and discovering patterns in them. Data mining concepts, metrics to measure its effectiveness. Methods in classification, clustering, frequent pattern analysis. Selected topics from current advances in data mining. Students are expected to have a preparation in Discrete Mathematics and Data Structures equivalent to CS272 and CS278. Requires more advanced graduate work than CS488. ",
            "link": 488,
            "taughtWith": null
        },
        "509": {
            "name": "Bioinformatics Programming",
            "credits": "3 Credits (3)",
            "description": "Computer programming to analyze high-throughput molecular biology data including genomic sequences, bulk and single-cell transcriptome, epigenome, and other omics data. Quality control, library size normalization, confounding effect removal, clustering, statistical modeling, trajectory inference, and visualization.  Requires more advanced graduate work than CS489.",
            "link": 489,
            "taughtWith": null
        },
        "510": {
            "name": "Automata, Languages, Computability",
            "credits": "3 Credits (3)",
            "description": "Regular and context-free languages, pushdown and finite-state automata, Turing machines, models of computation, halting problems. Students are expected to have knowledge of compilers design and algorithms equivalent to CS370 and CS372.",
            "link": null,
            "taughtWith": null
        },
        "513": {
            "name": "Computer Security",
            "credits": "3 Credits (3)",
            "description": "Introduction to the art and science of computer security.Fundamentals of computer security including elementary cryptography, authentication and access control, security threats, attacks, detection and prevention in application software, operating systems, networks and databases.   Requires more advanced graduate work than C S 578. Recommended knowledge of materials in CS272 and CS273.  ",
            "link": null,
            "taughtWith": 578
        },
        "514": {
            "name": "Introduction to Smart Grids",
            "credits": "3 Credits (3)",
            "description": "This course is an introduction to the technologies and design strategies associated with the Smart Grid. The emphasis will be on the development of communications, energy delivery, coordination mechanisms, and management tools to monitor transmission and distribution networks. Topics include: Smart grid introduction and evolution; Power systems; Networking and transport control; Artificial intelligence &amp; agent coordination; Data mining for smart grids.  Requires more advanced work than CS494.  ",
            "link": 494,
            "taughtWith": null
        },
        "515": {
            "name": "Human-Centered Computing",
            "credits": "3 Credits (3)",
            "description": "Covers iterative, human-centered interface design, including prototyping and evaluation. Basics of graphic design and visualization.  Requires more advanced graduate work than CS485 with an emphasis on studying recent research in human-computer interaction. Students are expected to have knowledge of software engineering equivalent to CS371.",
            "link": 485,
            "taughtWith": null
        },
        "516": {
            "name": "Bioinformatics",
            "credits": "3 Credits (3)",
            "description": "Introduction to bioinformatics and computational biology. Computational approaches to sequences analysis, protein structure prediction and analysis, and selected topics from current advances in bioinformatics; taught with CS486; requires more advanced graduate work than CS486. Students are expected to have a knowledge of algorithms and data structures equivalent to CS372 or exposure to Biology (equivalent to BIOL2310 or BIOL311).",
            "link": 486,
            "taughtWith": null
        },
        "517": {
            "name": "Digital Game Design",
            "credits": "3 Credits (3)",
            "description": "An introduction to digital game design. Topics include design, development, and playtesting of games. The course is structured to use team-based learning.  Requires more advanced graduate work than CS477 with deeper attention to a team game project.",
            "link": 477,
            "taughtWith": null
        },
        "518": {
            "name": "Visual Programming",
            "credits": "3 Credits (3)",
            "description": "Design and implementation of programs using visual (i.e. dataflow or diagrammatic) programming techniques, with an emphasis on real-time data processing. Students will learn how to design visual programs, including how to handle cycles and state maintenance, and will learn to process audio, video, and other data using visual programs.  Students must be in  graduate standing to enroll.  Requires more advanced graduate work than CS481.",
            "link": 481,
            "taughtWith": null
        },
        "519": {
            "name": "Applied Machine Learning I",
            "credits": "3 Credits (3)",
            "description": "An introductory course on practical machine learning. An overview of concepts for both unsupervised and supervised learning. Topics include classification, regression, clustering, and dimension reduction. Classical methods and algorithms such as linear regression, neural networks, support vector machines, and ensemble approaches. Recent techniques such as deep learning. Focused on applying of machine learning techniques in application domains.  Requires more advanced graduate work than CS487.",
            "link": 487,
            "taughtWith": null
        },
        "521": {
            "name": "Parallel Programming",
            "credits": "3 Credits (3)",
            "description": "Programming of shared memory and distributed memory machines; tools and languages for parallel programming; parallelizing compilers; parallel programming environments; taught with CS491; requires more advanced graduate work than CS491. Students are expected to have knowledge of programming and machine organization equivalent to CS271 and CS273.",
            "link": 491,
            "taughtWith": null
        },
        "522": {
            "name": "Cloud and Edge Computing",
            "credits": "3 Credits (3)",
            "description": "The course presents a top-down view of cloud computing, from applications and administration to programming and infrastructure. Its main focus is on the concepts of networking and parallel programming for cloud computing and large scale distributed systems which form the cloud infrastructure. The topics include: overview of cloud computing, cloud systems, parallel processing in the cloud, distributed storage systems, virtualization, security in the cloud, and multicore operating systems. Students will study state-of-the-art approaches to cloud computing followed by large cloud corporations, namely Google, Amazon, Microsoft, and Yahoo. Students will also apply what they learn through project developments using Amazon Web Services. Might have additional requirements for graduate students.  To enroll in this course a background in CS484/CS504 is preferred or have consent from the instructor.  Requires more advanced graduate work than CS496.",
            "link": 496,
            "taughtWith": null
        },
        "525": {
            "name": "Introduction to Cryptography",
            "credits": "3 Credits (3)",
            "description": "The course covers basic cryptographic primitives, such as symmetric, public-key ciphers, digital signature schemes, and hash functions, and their mathematical underpinnings. Course helps students understand basic notions of security in a cryptographic sense: chosen plaintext and chosen ciphertext attacks, games, and reductions. Course also covers computational number theory relevant to cryptography. Consent of Instructor required.  Requires more advanced graduate work than CS380. ",
            "link": 380,
            "taughtWith": null
        },
        "531": {
            "name": "Principles of Virtual Reality",
            "credits": "3 Credits (3)",
            "description": "This course is an introduction to building systems and doing research in / on virtual reality. We cover system design, development, and evaluation, with an emphasis on recent research in the space. We cover a range of methods, qualitative and quantitative, in order to develop insights into effective VR designs. Students in this class will develop a foundation in VR development; learn about current topics in VR; and design, develop, evaluate, and report on a VR system. Consent of Instructor required. Crosslisted with: C S 381. ",
            "link": null,
            "taughtWith": null
        },
        "532": {
            "name": "Modern Web Technologies",
            "credits": "3 Credits (3)",
            "description": "In this course, we will take a full-stack approach to modern web application design. We will start with the fundamentals including HTML5, CSS3, Javascript, JSON, and the underlying networking concepts and protocols driving the modern web. We will then move on to more advanced topics including javascript backend development with Node.js, NoSQL database design with MongoDB, cloud computing, and re- sponsive web design. Finally, we cover advanced topics including the design and im- plementation of browser extensions and real-time web technologies like WebRTC and WebSockets. Consent of Instructor required.  Requires more advanced graduate work than CS382.",
            "link": 382,
            "taughtWith": null
        },
        "570": {
            "name": "Analysis of Algorithms",
            "credits": "3 Credits (3)",
            "description": "Techniques for design and analysis of algorithms; time and space complexity; proving correctness of programs. Particular algorithms such as sorting, searching, dynamic programming. NP complete problems. Students are expected to have knowledge of algorithms and data structures equivalent to CS372.",
            "link": null,
            "taughtWith": null
        },
        "571": {
            "name": "Programming Language Structure II",
            "credits": "3 Credits (3)",
            "description": "Formal semantics of programming languages. Students are expected to have knowledge of algorithms and data structures equivalent to CS372, and knowledge of principles of programming languages equivalent to CS471.",
            "link": null,
            "taughtWith": null
        },
        "573": {
            "name": "Architectural Concepts II",
            "credits": "3 Credits (3)",
            "description": "Advanced topics related to computer architecture, guided by the current literature. Students are expected to have knowledge of computer architectures equivalent to CS473 and of operating systems equivalent to CS474. Crosslisted with: EE564.",
            "link": null,
            "taughtWith": null
        },
        "574": {
            "name": "Operating Systems II",
            "credits": "3 Credits (3)",
            "description": "Advanced topics related to operating system principles, guided by the current literature.  Students are expected to have knowledge of computer architectures and operating systems equivalent to CS473 and CS474.",
            "link": null,
            "taughtWith": null
        },
        "575": {
            "name": "Artificial Intelligence II",
            "credits": "3 Credits (3)",
            "description": "Covers advanced theory and application of artificial intelligence. Concentration on several specific research areas, such as knowledge representation, problem solving, common-sense reasoning, natural language understanding, automated tutoring systems, learning systems.  Students are expected to have knowledge of artificial intelligence equivalent to CS475.",
            "link": null,
            "taughtWith": null
        },
        "579": {
            "name": "Special Topics",
            "credits": "1-6 Credits",
            "description": "Topic announced in the Schedule of Classes.  ",
            "link": null,
            "taughtWith": null
        },
        "581": {
            "name": "Advanced Software Engineering",
            "credits": "3 Credits (3)",
            "description": "Advanced tools and methods for developing large software systems. Topics include object-oriented modeling and design, component architectures, templates and generic programming, software configuration and revision control, static and dynamic analysis tools, model, checking, advanced testing, and verification. Students are expected to have knowledge of software engineering equivalent to CS371.",
            "link": null,
            "taughtWith": null
        },
        "582": {
            "name": "Database Management Systems II",
            "credits": "3 Credits (3)",
            "description": "Advanced data models and abstractions, dependencies, implementations, languages, database machines, and other advanced topics. Students are expected to have knowledge of data base management systems equivalent to CS482.",
            "link": null,
            "taughtWith": null
        },
        "583": {
            "name": "Advanced Cryptography",
            "credits": "3 Credits (3)",
            "description": "This is an advanced cryptography course, which will cover cryptographic protocols such as zero-knowledge proofs, secret sharing schemes, secure two-party/multi-party computation, and more. We will also briefly cover real-world applications of these protocols. Students will also be exposed to recent research topics in cryptography (exact topics might vary every offering).  ",
            "link": null,
            "taughtWith": null
        },
        "584": {
            "name": "Computer Networks II",
            "credits": "3 Credits (3)",
            "description": "Advanced topics in computer networks. Covers advanced topics in networking, with emphasis on wireless, and IP networks. Students are expected to have knowledge of computer networks equivalent to CS484, and of statistics equivalent to MATH 371 or MATH 470.",
            "link": null,
            "taughtWith": null
        },
        "586": {
            "name": "Algorithms in Systems Biology",
            "credits": "3 Credits (3)",
            "description": "The course will introduce important algorithms and computational models used in systems biology to study molecular mechanisms for cellular dynamics, processes, and systems.  Cellular processes, such as metabolism and signal transduction, are studied as systems and networks quantitatively from high throughput molecular measurements.  The topics include molecular biological systems, network alignment, model simulation, network inference, model optimization, and hybrid models.  Students will be able to construct models and analyze their properties in the context of molecular biological systems. Students are expected to have knowledge of algorithms and data structures equivalent to CS372.",
            "link": null,
            "taughtWith": null
        },
        "587": {
            "name": "Advanced Human-Centered Computing",
            "credits": "3 Credits (3)",
            "description": "Covers a range of methods available for performing research in the field of human-computer interaction in order to develop insights into effective human-centered designs of computing systems. Students will develop insights into how humans live, play, and work and best practices in system design. ",
            "link": null,
            "taughtWith": null
        },
        "589": {
            "name": "Special Research Problems",
            "credits": "1-6 Credits",
            "description": "Faculty-supervised investigation, to culminate in a written report.  May be repeated; maximum of 6 credits may be applied toward M.S. degree. Restricted to majors.",
            "link": null,
            "taughtWith": null
        },
        "598": {
            "name": "Master's Project",
            "credits": "1-6 Credits",
            "description": "Project-oriented capstone course to be completed by M.S. students under supervision of their advisor. Maximum of 6 credits may be applied toward M.S. degree.  Restricted to C S majors.",
            "link": null,
            "taughtWith": null
        },
        "599": {
            "name": "Master's Thesis",
            "credits": "1-6 Credits (1-6)",
            "description": "Thesis to be developed by M.S. Students under supervision of their advisor.  May be repeated for a maximum of 6 credits. Restricted to majors.",
            "link": null,
            "taughtWith": null
        },
        "600": {
            "name": "Pre-dissertation Research",
            "credits": "1-15 Credits",
            "description": "Pre-dissertation research.",
            "link": null,
            "taughtWith": null
        },
        "700": {
            "name": "Doctoral Dissertation",
            "credits": "1-15 Credits",
            "description": "Dissertation.",
            "link": null,
            "taughtWith": null
        }
    }
}