{
    "metadata": {
        "subject": "Biology",
        "abbreviation": "BIOL",
        "common": [
            "bio",
            ""
        ]
    },
    "courses": {
        "301": {
            "name": "Principles of Ecology",
            "credits": "3 Credits (3)",
            "description": "A survey of ecology including general theory, the adaptations of organisms, population dynamics, species interactions, and the structure and function of natural communities and ecosystems. MATH1511G and AST311 recommended. Same as ENVS301. Crosslisted with: ENVS301. ",
            "link": null,
            "taughtWith": null
        },
        "302": {
            "name": "Molecular Biology Techniques Laboratory",
            "credits": "3 Credits (6P)",
            "description": "This combined lecture and laboratory course emphasizes molecular biology laboratory practices through the hands-on application of commonly applied techniques, protocols, and equipment. The topics covered include both the fundamental development of empirical data as well as data analysis using stand-alone and web-based resources. Consent of instructor required. ",
            "link": null,
            "taughtWith": null
        },
        "305": {
            "name": "Principles of Genetics",
            "credits": "3 Credits (3)",
            "description": "Covers fundamental principles of reproduction, variation, and heredity in plants and animals. Crosslisted with: HORT305 and AGRO305. ",
            "link": null,
            "taughtWith": null
        },
        "309": {
            "name": "Guided Biological Research Lab",
            "credits": "3 Credits (3)",
            "description": "This laboratory course provides a guided experience to hands-on research in biology. It is intended for early-career undergraduates who have finished the introductory sequence of Biology courses. Topics will vary with instructor. ",
            "link": null,
            "taughtWith": null
        },
        "311": {
            "name": "General Microbiology Laboratory",
            "credits": "2 Credits (4P)",
            "description": "Microbiology techniques and procedures, including isolation and identification of microorganisms and biotechnology procedures that employ microorganisms. ",
            "link": null,
            "taughtWith": null
        },
        "312": {
            "name": "Plant Taxonomy",
            "credits": "3 Credits (2+3P)",
            "description": "Classification and identification of representative plant families and local plants. Emphasis on ability to use technical sources. Saturday field trips may be recommended. ",
            "link": null,
            "taughtWith": null
        },
        "313": {
            "name": "Structure and Function of Plants",
            "credits": "3 Credits (2+3P)",
            "description": "Structure, function, and survey of plants. BIOL2110G recommended. ",
            "link": null,
            "taughtWith": null
        },
        "314": {
            "name": "Plant Physiology",
            "credits": "3 Credits (3)",
            "description": "Photosynthesis, respiration, water relation of plants, minerals and organic nutrition, growth and development. ",
            "link": null,
            "taughtWith": null
        },
        "322": {
            "name": "Zoology",
            "credits": "3 Credits (2+3P)",
            "description": "Structure, function, and survey of animals. BIOL2110G recommended. ",
            "link": null,
            "taughtWith": null
        },
        "350": {
            "name": "Special Topics",
            "credits": "1-4 Credits",
            "description": "Specific subjects announced in Schedule of Classes and offered as scheduled courses. May be repeated for unlimited credit.",
            "link": null,
            "taughtWith": null
        },
        "351": {
            "name": "Biology Internship",
            "credits": "1-6 Credits",
            "description": "Substantial off-campus experience in biology selected by student in consultation with regular biology faculty member. Internship must be approved by faculty member. Student will supply mutually agreed upon documentation of internship activities after the internship is completed.  May be repeated up to 6 credits.  Restricted to: BIOL, MBIO, CEC, GEBT majors. Graded: S/U Grading (S/U, Audit).",
            "link": null,
            "taughtWith": null
        },
        "353": {
            "name": "Pre-Professional Human Anatomy Laboratory",
            "credits": "1 Credit (3P)",
            "description": "Laboratory experience in human anatomy using anatomical models and cat dissections. Designed as a learning aid to support and augment BIOL353 pre-professional Human Anatomy. For students planning careers in health and allied health sciences such as medicine, dentistry, nursing, physical therapy, physicians aid, human nutrition, and food science. May be repeated up to 1 credits. ",
            "link": null,
            "taughtWith": null
        },
        "354": {
            "name": "Laboratory of Human Physiology",
            "credits": "1 Credit (3P)",
            "description": "Laboratory to accompany BIOL354. ",
            "link": null,
            "taughtWith": null
        },
        "373": {
            "name": "Fungal Biology",
            "credits": "3 Credits (3+2P)",
            "description": "Same as EPWS 372. ",
            "link": null,
            "taughtWith": null
        },
        "377": {
            "name": "Cell Biology",
            "credits": "3 Credits (3)",
            "description": "Fundamentals of eukaryotic cell structure, organization, and function. Emphasis on membranes, subcellular organelle systems, cytoskeleton, and cell cycle. Includes basic aspects of molecular biology. May be repeated up to 3 credits.  BIOL2610G recommended.",
            "link": null,
            "taughtWith": null
        },
        "381": {
            "name": "Animal Physiology",
            "credits": "3 Credits (3)",
            "description": "Principles of integrative function in animals, emphasizing tissues, organs, organ systems, and regulation. Includes adaptations of animals to their environments. BIOL2610G and BIOL377 recommended. ",
            "link": null,
            "taughtWith": null
        },
        "382": {
            "name": "Plant Signalling and Development",
            "credits": "3 Credits (3)",
            "description": "This is a course that introduces plant signalling pathways and their role in development to students. The lectures are structured to facilitate in-class discussions on the current state and future directions in this field. Topics will cover a wide range of biological questions and the methods used to study them. May be repeated up to 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "385": {
            "name": "An Introduction to Cancer",
            "credits": "3 Credits (3)",
            "description": "This course will cover 3 areas of cancer research and their interdisciplinary connections: clinical cancer research, epidemiology and public health, and basic cancer research. May be repeated up to 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "398": {
            "name": "Biology Research Programs",
            "credits": "1-3 Credits",
            "description": "Directed studies and research experiences, by arrangement with instructor. May be repeated for a maximum of 6 credits.",
            "link": null,
            "taughtWith": null
        },
        "402": {
            "name": "Biology Honors Thesis",
            "credits": "1-3 Credits (1-3)",
            "description": "Provides guidance in how to write a scientific paper in the sciences. Students will produce an honors thesis based on previous independent research. Consent of instructor required. ",
            "link": null,
            "taughtWith": null
        },
        "412": {
            "name": "Seminar in Microbiology",
            "credits": "1 Credit (1)",
            "description": "Seminar to aid students in assessment and presentation of current topics in microbiology. ",
            "link": null,
            "taughtWith": null
        },
        "417": {
            "name": "Topics in Environmental Microbiology",
            "credits": "3 Credits (3)",
            "description": "This is an advanced undergraduate course based on current literature in Environmental Microbiology, and is a seminar-style, discussion-based class. Topics typically include marine microbiology, ancient DNA, and the human microbiome. Crosslisted with: BIOL577. ",
            "link": null,
            "taughtWith": null
        },
        "424": {
            "name": "Human Osteology",
            "credits": "3 Credits (3)",
            "description": "A survey of the functional, developmental, and evolutionary biology of the human skeleton. Identifying bones and teeth from hands-on experience with skeletal and dental material. Provides a foundation for human evolutionary studies, bioarchaeology and forensic anthropology. Students are recommended to take ANTH355 or an equivalent before enrolling in this course. BIOL 424L should be taken concurrently when it is offered. Crosslisted with: ANTH474.",
            "link": null,
            "taughtWith": null
        },
        "427": {
            "name": "Symbiosis",
            "credits": "3 Credits (3)",
            "description": "In-depth treatment of the ecology, evolution, and mechanisms that are found in symbiotic systems. May be repeated up to 3 credits. Crosslisted with: BIOL527. ",
            "link": null,
            "taughtWith": null
        },
        "434": {
            "name": "Human Evolution",
            "credits": "3 Credits (3)",
            "description": "Overview of human biological evolution from the emergence of Miocene apes to the modern human diaspora. BIOL 424L should be taken concurrently when it is offered. Crosslisted with: ANTH434. ",
            "link": null,
            "taughtWith": null
        },
        "436": {
            "name": "Disease Vector Biology",
            "credits": "3 Credits (3)",
            "description": "Fundamentals of disease vector biology with emphasis on molecular biology. Explores an overview of vector borne diseases, insect endocrinology, insect immunity, olfaction, vector genome projects and transgenic insect techniques. Includes student presentations and literature discussions.  Crosslisted with: BIOL536",
            "link": null,
            "taughtWith": null
        },
        "442": {
            "name": "Genomics Technology",
            "credits": "3 Credits (3)",
            "description": "The course introduces current genomic techniques in genome sequencing, transcriptome analysis, detection of genetic variation, and metagenomics. May be repeated up to 3 credits. Crosslisted with: BIOL562. ",
            "link": null,
            "taughtWith": null
        },
        "446": {
            "name": "Bioinformatics and NCBI Database",
            "credits": "3 Credits (3)",
            "description": "The course discusses how to use NCBI database and bioinformatic tools for research with genomics approaches. The topics include nucleotide and protein sequence analysis, similarity search with blast algorithms, gene/genome annotation, protein structure analysis, gene expression analysis, and metagenomic study. ",
            "link": null,
            "taughtWith": null
        },
        "450": {
            "name": "Special Topics",
            "credits": "1-3 Credits",
            "description": "Specific subjects announced in the Schedule of Classes and offered as scheduled courses. May be repeated for unlimited credit.",
            "link": null,
            "taughtWith": null
        },
        "451": {
            "name": "Physiology of Microorganisms",
            "credits": "3 Credits (3)",
            "description": "Aspects of cellular physiology unique to prokaryotes. BCHE395 recommended. ",
            "link": null,
            "taughtWith": null
        },
        "455": {
            "name": "Biometry",
            "credits": "3 Credits (3)",
            "description": "Biometry is the analysis of biological data using mathematical and statistical models. The course will cover basic theories of probability and statistics and will introduce principles of sampling, estimation, experimental design, and hypothesis testing. Students will analyze biological data using computer programs and will perform tests for goodness-of-fit, independence, analysis of variance, correlation, and regression. ",
            "link": null,
            "taughtWith": null
        },
        "459": {
            "name": "Darwinism versus Creationism Honors",
            "credits": "3 Credits (3)",
            "description": "This course will examine the history and philosophy surrounding the debate between Darwinism and Creationism. The course will also examine the consequences of the debate at the interface of sociology, economics, politics, and education. The Honors version of the course (BIOL 459H) will require a term paper in addition to the requirements of BIOL459. Crosslisted with: BIOL459. ",
            "link": null,
            "taughtWith": null
        },
        "462": {
            "name": "Conservation Biology",
            "credits": "3 Credits (3)",
            "description": "Examination of the value of biological diversity, the natural processes that control biological diversity, and the ways in which human activities have resulted in the loss of biological diversity, both regionally and globally. ",
            "link": null,
            "taughtWith": null
        },
        "465": {
            "name": "Invertebrate Zoology",
            "credits": "4 Credits (3+3P)",
            "description": "Survey, ecology, behavior and physiology. BIOL322 recommended. ",
            "link": null,
            "taughtWith": null
        },
        "466": {
            "name": "Invertebrate Zoology Field Trip",
            "credits": "1 Credit (1)",
            "description": "A one-week field trip for the study of marine invertebrates. Registrants must provide own camping gear. Graded: S/U. ",
            "link": null,
            "taughtWith": null
        },
        "467": {
            "name": "Evolution",
            "credits": "3 Credits (3)",
            "description": "Covers theory, historical background, population variation, natural selection, adaptation, speciation. ",
            "link": null,
            "taughtWith": null
        },
        "469": {
            "name": "Biology of Emerging Infectious Diseases",
            "credits": "3 Credits (3)",
            "description": "This class will investigate the evolutionary and ecological drivers of disease emergence. The effect of emerging diseases on human health will be addressed throughout the class, but the class will also consider the consequences of disease emergence for the health of wildlife and plant populations. Additionally, the class will consider the mechanisms used to control disease emergence and why they succeed or fail. ",
            "link": null,
            "taughtWith": null
        },
        "470": {
            "name": "Developmental Biology",
            "credits": "3 Credits (3)",
            "description": "The purpose of this course is to introduces students to the principles that govern the development of a single fertilized egg cell into a complex multicellular organism. These principles, and often the molecular mechanisms by which they are accomplished, appear to be universal for all multicellular organisms including both plants and animals. We will explore issues such as: how cells become committed to particular cell fates and how this commitment is maintained; how organs acquire particular shapes, sizes and positions; the developmental causes of some human diseases; how the environment affects development; and, how changes in development provide the material basis for evolutionary change. ",
            "link": null,
            "taughtWith": null
        },
        "472": {
            "name": "Primate Behavior and Ecology",
            "credits": "3 Credits (3)",
            "description": "Survey of the social behavior and ecology of nonhuman primates. Crosslisted with: ANTH472. ",
            "link": null,
            "taughtWith": null
        },
        "473": {
            "name": "Ecology of Microorganisms",
            "credits": "3 Credits (2+3P)",
            "description": "The metabolic interactions of microorganisms in the environment, with emphasis on their roles in ecological processes. ",
            "link": null,
            "taughtWith": null
        },
        "474": {
            "name": "Immunology",
            "credits": "3 Credits (3)",
            "description": "Basic concepts of the immune response. ",
            "link": null,
            "taughtWith": null
        },
        "475": {
            "name": "Virology",
            "credits": "3 Credits (3)",
            "description": "Mechanisms of viral infections of animals and man. BCHE395 or BIOL305 are recommended. ",
            "link": null,
            "taughtWith": null
        },
        "476": {
            "name": "Soil Microbiology Laboratory",
            "credits": "1 Credit (3P)",
            "description": "Enumeration of soil microorganisms, their activities, and transformations they mediate.  Same as SOIL 476L.  ",
            "link": null,
            "taughtWith": null
        },
        "477": {
            "name": "Applied and Environmental Microbiology",
            "credits": "4 Credits (4)",
            "description": "A lecture-laboratory course on the microorganisms and the reactions they mediate which either impact the environment or have industrial applications. Reading of current literature will be emphasized. Topics include bioremediation, water quality, and aspects of industrial and food microbiology. ",
            "link": null,
            "taughtWith": null
        },
        "478": {
            "name": "Molecular Biology of Microorganisms",
            "credits": "3 Credits (3)",
            "description": "The biochemical basis for gene mutation, recombination, and expression with emphasis on prokaryotes. Includes fundamentals of recombinant DNA technology. BIOL305 and BCHE395 recommended. ",
            "link": null,
            "taughtWith": null
        },
        "479": {
            "name": "Medical Microbiology Laboratory",
            "credits": "1 Credit (1)",
            "description": "Overview of common procedures used by medical microbiologists to identify agents of disease or microbial pathogen traits. May be repeated up to 1 credits. ",
            "link": null,
            "taughtWith": null
        },
        "480": {
            "name": "Animal Behavior",
            "credits": "3 Credits (3)",
            "description": "A survey of the field of animal behavior. BIOL322 recommended. ",
            "link": null,
            "taughtWith": null
        },
        "484": {
            "name": "Animal Communication",
            "credits": "3 Credits (3)",
            "description": "An examination of how animals produce and perceive signals, what factors influence the form of signals in different sensory modalities, and how conflicts between senders and receivers affect signaling strategies. Weekly discussion from the primary literature and group research products. ",
            "link": null,
            "taughtWith": null
        },
        "488": {
            "name": "Principles of Conservation Genetics",
            "credits": "3 Credits (3)",
            "description": "Fundamentals of the genetics of small populations. Genetic technologies used in studying small populations. Application of genetics and evolution to the conservation of biological populations. ",
            "link": null,
            "taughtWith": null
        },
        "489": {
            "name": "Genetic Aspects of Population Biology",
            "credits": "3 Credits (3)",
            "description": "Basic theory of population genetics and how that theory has guided, and been influenced by, studies of natural populations. ",
            "link": null,
            "taughtWith": null
        },
        "490": {
            "name": "Neurobiology",
            "credits": "3 Credits (3)",
            "description": "Fundamentals of neurobiology with an emphasis on properties of neurons and glia, principles of synaptic transmission, development of nervous system and organization of motor and sensory systems. ",
            "link": null,
            "taughtWith": null
        },
        "498": {
            "name": "Biology Research Programs",
            "credits": "1-3 Credits",
            "description": "Directed studies and research experiences, by arrangement with instructor. May be repeated for a maximum of 6 credits.",
            "link": null,
            "taughtWith": null
        },
        "509": {
            "name": "Guided Biological Research Lab",
            "credits": "3 Credits (3P)",
            "description": "This laboratory course provides a guided experience to hands-on research in biology. It is intended for early-career graduate students wishing an introduction to research practices. Topics will vary with instructor. Crosslisted with: BIOL309. ",
            "link": null,
            "taughtWith": null
        },
        "510": {
            "name": "Current Topics in Biology",
            "credits": "3 Credits (3)",
            "description": "Introduction to diverse topics in modern biology, including dynamic areas of current research. ",
            "link": null,
            "taughtWith": null
        },
        "514": {
            "name": "Plant Physiology",
            "credits": "2 Credits (2)",
            "description": "Same as EPWS514. ",
            "link": null,
            "taughtWith": null
        },
        "520": {
            "name": "Molecular Cell Biology",
            "credits": "3 Credits (3)",
            "description": "An in-depth look at cellular processes and structures at the molecular level. Emphasis is placed on formal student presentations and discussions of current literature. ",
            "link": null,
            "taughtWith": null
        },
        "527": {
            "name": "Symbiosis",
            "credits": "3 Credits (3)",
            "description": "In-depth treatment of the ecology, evolution, and mechanisms that are found in symbiotic systems. May be repeated up to 3 credits. Crosslisted with: BIOL427. ",
            "link": null,
            "taughtWith": null
        },
        "536": {
            "name": "Advanced Disease Vector Biology",
            "credits": "3 Credits (3)",
            "description": "Fundamentals of disease vector biology with emphasis on molecular biology. Explores an overview of vector borne diseases, insect endocrinology, insect immunity, olfaction, vector genome projects and transgenic insect techniques. Includes student presentations and literature discussions.  ",
            "link": 436,
            "taughtWith": null
        },
        "540": {
            "name": "Science and Ethics",
            "credits": "1-3 Credits (1-3)",
            "description": "Ethical concerns facing researchers in the basic and applied biological sciences. Coverage of responsible conduct in research including scientific integrity and research misconduct, mentor/trainee responsibilities, data management, authorship, publication practices, human subjects, animal welfare, intellectual property, conflicts of interest and effort and collaborative science. Emphasis on ethical reasoning skills. Discussion of ethical and societal implications of issues selected from a broad range of contemporary research areas (genetics, reproductive biology, environmental sciences, nanoscience, drug discovery, bioengineering, neuroscience). Subtitled.  May be repeated up to 4 credits. Crosslisted with: PHIL 540.",
            "link": null,
            "taughtWith": null
        },
        "541": {
            "name": "Professional Development Seminar",
            "credits": "1-3 Credits",
            "description": "Practical aspects of career enhancement including job seeking, professional presentations, grant proposals, etc. ",
            "link": null,
            "taughtWith": null
        },
        "550": {
            "name": "Special Topics",
            "credits": "1-3 Credits",
            "description": "Readings, discussions, and/or field and laboratory investigation of selected problems. Possible topics: human genetics, systematic entomology, or parasitism in animals.  May be repeated for unlimited credit.",
            "link": null,
            "taughtWith": null
        },
        "562": {
            "name": "Advanced Genomics Technology",
            "credits": "3 Credits (3)",
            "description": "This course covers current genomics techniques in genome sequencing, transcriptome analysis, detection of genetic variation, and metagenomics. May be repeated up to 3 credits. Consent of Instructor required. Crosslisted with: BIOL442.",
            "link": null,
            "taughtWith": null
        },
        "565": {
            "name": "Biology In The K-6 Curriculum",
            "credits": "3 Credits (3)",
            "description": "Linking important biological concepts to the K-6 curriculum and standards. Addressing known content area challenges with effective pedagogical approaches. Aligning content, standards, classroom activities and assessment. Does not fulfill requirements for degrees in biology. Consent of Instructor required. Restricted to: Master of Arts in Education: Elementary Mathematics and Science majors.",
            "link": null,
            "taughtWith": null
        },
        "566": {
            "name": "Advanced Bioinformatics and NCBI Database",
            "credits": "3 Credits (3)",
            "description": "The course discusses how to use NCBI database and bioinformatic tools for research with genomics approaches.  The topics include nucleotide and protein sequence analysis, similarity search with blast algorithms, gene/genome annotation, protein structure analysis, gene expression analysis, and metagenomic study.  Consent of Instructor required. ",
            "link": null,
            "taughtWith": null
        },
        "568": {
            "name": "Communities and Ecosystems",
            "credits": "3 Credits (3)",
            "description": "Community ecology is an interdisciplinary field that integrates numerous theories, concepts, and methods to study the patterns and dynamics of biotic assemblages. Because biotic groups affect the biogeophysical and biogeochemical processes that govern Earth system functioning, community ecology also plays an increasingly large role in the study of ecosystem ecology, a discipline which seeks to understand the processes governing nutrient and energy flow across the Earth system. This course will explore the theories and methods for study of biodiversity, biogeography, and community assembly, as well as the pathways through which communities exert influence on ecosystem functioning. Topics will also include evolutionary influences on communities, the integration of community ecology into conservation and land management, and community ecology in an era of rapid environmental change. ",
            "link": null,
            "taughtWith": null
        },
        "572": {
            "name": "Advanced Primate Behavior and Ecology",
            "credits": "3 Credits (3)",
            "description": "Advanced review of non-human primate social behavior and ecology. Crosslisted with: ANTH 572. ",
            "link": null,
            "taughtWith": null
        },
        "577": {
            "name": "Advanced Topics in Environmental Microbiology",
            "credits": "3 Credits (3)",
            "description": "This course is based on current literature in Environmental Microbiology, and is a seminar-style, discussion-based class.  Topics typically include marine microbiology, ancient DNA and the human microbiome.  ",
            "link": null,
            "taughtWith": null
        },
        "581": {
            "name": "Physiology of Animals",
            "credits": "3 Credits (3)",
            "description": "Comprehensive treatment of integrative physiology of animals, emphasizing tissues, organ systems, and regulatory control, including neuroendocrine function, circulation, respiration, and excretion. Term paper required.  BIOL2610G, BIOL377 recommended.",
            "link": null,
            "taughtWith": null
        },
        "582": {
            "name": "Advanced Plant Signalling and Development",
            "credits": "3 Credits (3)",
            "description": "This is a course that introduces plant signalling pathways and their role in development to students. The lectures are structured to facilitate in-class discussions on the current state and future directions in this field. Topics will cover a wide range of biological questions and the methods used to study them. May be repeated up to 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "587": {
            "name": "Behavioral and Evolutionary Ecology",
            "credits": "3 Credits (3)",
            "description": "This course will investigate the causes and consequences of phenotypic variation and the adaptive value of phenotypic traits. ",
            "link": null,
            "taughtWith": null
        },
        "590": {
            "name": "Neuroscience",
            "credits": "1-3 Credits",
            "description": "Detailed examination of the principles underlying nervous system organization and function. Emphasis on recent advances in multidisciplinary, integrated approaches to study the nervous system.  May be repeated up to 9 credits. ",
            "link": null,
            "taughtWith": null
        },
        "598": {
            "name": "Special Research Programs",
            "credits": "1-9 Credits",
            "description": "Individual investigations either analytical or experimental.",
            "link": null,
            "taughtWith": null
        },
        "599": {
            "name": "Master's Thesis",
            "credits": "15 Credits",
            "description": "Thesis.",
            "link": null,
            "taughtWith": null
        },
        "600": {
            "name": "Doctoral Research",
            "credits": "1-15 Credits",
            "description": "Research.",
            "link": null,
            "taughtWith": null
        },
        "610": {
            "name": "Seminar",
            "credits": "1-3 Credits (1-3)",
            "description": "Oral presentation and discussion of journal articles and ongoing research projects.  May be repeated up to 6 credits. Graded: S/U Grading (S/U, Audit).",
            "link": null,
            "taughtWith": null
        },
        "612": {
            "name": "Microbiology Seminar",
            "credits": "1 Credit (1)",
            "description": "Seminar to aid graduate students in assessment and presentation of classical and current topics in microbiology.",
            "link": null,
            "taughtWith": null
        },
        "697": {
            "name": "University Teaching Experience",
            "credits": "1-3 Credits",
            "description": "Certain graduate students will be permitted to teach up to one-third of one of the biology courses. The student will prepare and deliver lectures and will prepare, administer, and grade at least one examination. The professor in charge of the course will attend and evaluate the student's lectures.",
            "link": null,
            "taughtWith": null
        },
        "698": {
            "name": "Selected Topics",
            "credits": "1-3 Credits",
            "description": "Selected topics for doctoral students.",
            "link": null,
            "taughtWith": null
        },
        "700": {
            "name": "Doctoral Dissertation",
            "credits": "15 Credits",
            "description": "Dissertation.",
            "link": null,
            "taughtWith": null
        },
        "1120": {
            "name": "Human Biology Laboratory",
            "credits": "1 Credit (3P)",
            "description": "This course introduces exercises, experiences, and activities exploring biological concepts and theories relevant to humans and their relationship to the environment in a laboratory setting.",
            "link": null,
            "taughtWith": null
        },
        "1130": {
            "name": "Introductory Anatomy &amp; Physiology (non-majors)",
            "credits": "4 Credits (3+3P)",
            "description": "This course introduces the anatomy (structure) and physiology (function) of the human body, which includes the study of basic chemistry, molecules, cells, tissues, organs, organ systems, and terminology related to these concepts. May be repeated up to 4 credits. Restricted to Community Colleges campuses",
            "link": null,
            "taughtWith": null
        },
        "1190": {
            "name": "Contemporary Problems in Biology",
            "credits": "4 Credits (3+3P)",
            "description": "Fundamental concepts of biology will be presented using examples from relevant problems in ecology, medicine and genetics. For nonscience majors only. Community Colleges only.",
            "link": null,
            "taughtWith": null
        },
        "1996": {
            "name": "Topics in Biology",
            "credits": "1-3 Credits (1-3)",
            "description": "Introductory level coverage of biological topics. May be repeated up to 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "2110": {
            "name": "Principles of Biology: Cellular and Molecular Biology Laboratory",
            "credits": "1 Credit (3P)",
            "description": "This course introduces students to major topics in general biology. This courses focuses on the principles of structure and function of living things at the molecular, cellular and organismic levels of organization. Major topics included are introduction to the scientific process, chemistry of cells, organization of cells, cellular respiration, photosynthesis, cell division, genetics, DNA replication, transcription, and translation. May be repeated up to 1 credits.   ",
            "link": null,
            "taughtWith": null
        },
        "2210": {
            "name": "Human Anatomy and Physiology I for the Health Sciences",
            "credits": "4 Credits (3+3P)",
            "description": "This course is the first of two that serve as an introduction to human anatomy and physiology for biology majors and allied health students. The course entails describing, explaining, and analyzing structure and function from the submicroscopic to the organismal level with emphasis on anatomic, directional, and sectional terminology, basic cellular structure and metabolism, tissue differentiation and characteristics, and organ system structure and function; Specifically the integumentary, skeletal, muscular, and nervous systems.  ",
            "link": null,
            "taughtWith": null
        },
        "2221": {
            "name": "Human Physiology",
            "credits": "3 Credits (3)",
            "description": "Physical and chemical operation of the organs and systems of the human body. Not open to students who have passed BIOL354 or BIOL381. ",
            "link": null,
            "taughtWith": null
        },
        "2225": {
            "name": "Human Anatomy and Physiology II",
            "credits": "4 Credits (3+3P)",
            "description": "This course is the second of two that serve as an introduction to human anatomy and physiology for biology majors and allied health students. The course entails describing, explaining, and analyzing structure and function from the submicroscopic to the organismal level with emphasis on specific cellular, tissue, and organ structure and physiology, and organ system structure and function; specifically the endocrine, cardiovascular, respiratory, urinary, and reproductive systems. Additionally, an analysis of these concepts is included: fluid and electrolyte balance, pregnancy, growth and development from zygote to newborn, and heredity. Restricted to: Community Colleges only.",
            "link": null,
            "taughtWith": null
        },
        "2310": {
            "name": "Microbiology Lab",
            "credits": "1 Credit (3P)",
            "description": "This course will emphasize both the theory and hands-on application of techniques used in a microbiology laboratory for the growth and identification of bacterial species.  Students will learn microscopy skills and staining techniques for the observation of bacteria.  Students will also learn aseptic techniques used for isolation of bacteria, inoculation of cultures, and interpretation of selective and differential growth media for the identification of bacterial species. ",
            "link": null,
            "taughtWith": null
        },
        "2320": {
            "name": "Public Health Microbiology",
            "credits": "3 Credits (3)",
            "description": "This course introduces microbiology on the health profession level. It incorporates cell structure, metabolism, growth, controls of growth, infectious epidemiology, etiology, pathogenicity, and relative virulence of pathogens. It will lead to students assessing a clinical infection scenario from the microbiological perspective that includes making diagnoses based on data from appropriate diagnostic tests, investigating appropriate treatment options, and making recommendations for prevention.  ",
            "link": null,
            "taughtWith": null
        },
        "2505": {
            "name": "Pathophysiology",
            "credits": "3 Credits (3)",
            "description": "This course is designed to provide the conscientious student with a solid foundation for understanding the  pathophysiological processes of the human organism. Successful completion of this course will promote the  general student learning outcomes listed below.  Corequisite/Prerequisites(s): AHS 154 or BIOL2225. Restricted to: Community Colleges only.",
            "link": null,
            "taughtWith": null
        },
        "2511": {
            "name": "Human Pathophysiology",
            "credits": "3 Credits (3)",
            "description": "The first in a two-course sequence that covers changes in body physiology that result from disease or injury. Includes a general introduction to pathophysiology as well as an overview of altered cellular and tissue biology, injury, inflammation, and neoplasia. Students will also explore deviation from fluid, hemodynamic, and endocrinologic balance. Topics related to the science of pathophysiology, including pathology, pathogenesis, etiology, epidemiology, and clinical manifestations, are also discussed throughout the course where relevant.   Grade of C- or higher in microbiology is recommended. Restricted to Community Colleges campuses only.",
            "link": null,
            "taughtWith": null
        },
        "2512": {
            "name": "Human Pathophysiology I",
            "credits": "3 Credits (3)",
            "description": "The second in a two-course sequence that covers changes in body physiology that result from disease or injury. This course focuses on the pathophysiology of the nervous, cardiovascular, lymphatic, respiratory, digestive, urinary, and reproductive systems. Topics related to the science of pathophysiology, including pathology, pathogenesis, etiology, epidemiology, and clinical manifestations, are also discussed throughout the course where relevant. Grade of C- or higher in microbiology is recommended. Restricted to Community Colleges campuses only. ",
            "link": null,
            "taughtWith": null
        },
        "2610": {
            "name": "Principles of Biology: Biodiversity, Ecology, and Evolution Laboratory",
            "credits": "1 Credit (3P)",
            "description": "This laboratory course is an introduction to the dynamic processes of living things. This course introduces students to the methods used in the study of Mendelian genetics, evolution, ecology, and biological diversity. Designed for students continuing in life sciences. ",
            "link": null,
            "taughtWith": null
        },
        "2996": {
            "name": "Special Topics",
            "credits": "1-3 Credits",
            "description": "Specific subjects to be announced in the Schedule of Classes. May be repeated for a maximum of 6 credits. Community Colleges only.",
            "link": null,
            "taughtWith": null
        }
    }
}