{
    "metadata": {
        "subject": "English",
        "abbreviation": "ENGL",
        "common": [
            "eng",
            "en",
            "engli"
        ]
    },
    "courses": {
        "301": {
            "name": "Theory and Criticism: Rhetoric and Culture",
            "credits": "3 Credits (3)",
            "description": "Introduction to rhetorical criticism with an emphasis on understanding the theoretical and cultural underpinnings for the rhetorical analyses of texts.",
            "link": null,
            "taughtWith": null
        },
        "302": {
            "name": "Theory and Criticism: Literature and Culture",
            "credits": "3 Credits (3)",
            "description": "Introduction to literary criticism, from its classical beginnings through contemporary critical approaches.",
            "link": null,
            "taughtWith": null
        },
        "303": {
            "name": "Theory and Criticism: Film, Media and Culture",
            "credits": "3 Credits (3)",
            "description": "Surveys classical and contemporary film theory. Explores the relationship of theory to textual analysis and filmmaking practices. Includes auteurism semiotics, psychoanalysis, and other theories, as well as theories of other media.",
            "link": null,
            "taughtWith": null
        },
        "304": {
            "name": "Creative Writing: Prose",
            "credits": "3 Credits (3)",
            "description": "Imaginative writing, chiefly prose narrative. Repeatable for a maximum of 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "306": {
            "name": "Creative Writing: Poetry",
            "credits": "3 Credits (3)",
            "description": "Introduction to the writing of poetry. Repeatable for a total of 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "307": {
            "name": "Creative Writing: Creative Nonfiction",
            "credits": "3 Credits (3)",
            "description": "Introduction to creative nonfiction. Skills emphasized will include the personal voice, powers of observation and reflection, advocacy, argument, and a creative, powerful use of language. Repeatable for a maximum of 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "308": {
            "name": "Creative Writing: Playwriting",
            "credits": "3 Credits (3)",
            "description": "Technique of one-act playwriting, and analysis of dramatic structure. Crosslisted with: THEA308",
            "link": null,
            "taughtWith": null
        },
        "309": {
            "name": "Screenwriting I",
            "credits": "3 Credits (3)",
            "description": "Writing intensive. Students learn the craft of screenwriting, honing skills in writing dialogue and visual narrative, crafting dynamic characters and dramatic action. Original student scripts will be performed and discussed in class.  Consent of instructor required.  Crosslisted with: CMI 309 and THTR 306",
            "link": null,
            "taughtWith": null
        },
        "310": {
            "name": "Critical Writing",
            "credits": "3 Credits (3)",
            "description": "A course in critical reading, writing, and research designed to prepare English majors for upper-division courses.",
            "link": null,
            "taughtWith": null
        },
        "315": {
            "name": "Writing for the Web",
            "credits": "3 Credits (3)",
            "description": "Introduction to writing for the World Wide Web through practical application and analysis on both theory and research. Allows hands-on learning in a computer classroom.",
            "link": null,
            "taughtWith": null
        },
        "321": {
            "name": "Modern European Drama",
            "credits": "3 Credits (3)",
            "description": "Masterworks of European drama from the late 18th century to present. Crosslisted with: THEA321V",
            "link": null,
            "taughtWith": null
        },
        "322": {
            "name": "Dramatic Character",
            "credits": "3 Credits (3)",
            "description": "How characters have been created for the stage from the beginning of theatrical performances in ancient Greece to the present day. Exploring characterization related to dramatic structure, style, and genre, and how dramatic characters differ from those in literary fiction. Crosslisted with: THEA322.",
            "link": null,
            "taughtWith": null
        },
        "323": {
            "name": "American Drama",
            "credits": "3 Credits (3)",
            "description": "Masterworks of American drama by noted American playwrights. Crosslisted with: THEA323",
            "link": null,
            "taughtWith": null
        },
        "326": {
            "name": "Cultural Identity and Representation Across the Media",
            "credits": "3 Credits (3)",
            "description": "Considers complex relationships between representation and culture including how images and language shape racial, ethnic, gender, sexual, and class identities. Examines theories from several disciplines. Includes lecture, discussion and production exercises.",
            "link": null,
            "taughtWith": null
        },
        "327": {
            "name": "Shakespeare around the Globe",
            "credits": "3 Credits (3)",
            "description": "Introduction to multicultural issues in Shakespeare's plays and to adaptations of Shakespeare's plays in other cultures.",
            "link": null,
            "taughtWith": null
        },
        "328": {
            "name": "Literature of Science Fiction and Fantasy",
            "credits": "3 Credits (3)",
            "description": "Survey and critical examination of the development of science fiction and fantasy as literature genres through selected authors and texts.",
            "link": null,
            "taughtWith": null
        },
        "329": {
            "name": "Studies in Drama",
            "credits": "3 Credits (3)",
            "description": "Emphasis on a group of related works of European or American drama; topics will vary. Crosslisted with: THEA329 and FDMA 329",
            "link": null,
            "taughtWith": null
        },
        "339": {
            "name": "Chicana/o Literature",
            "credits": "3 Credits (3)",
            "description": "Introduction to Chicano novels, short stories and selected creative nonfiction.",
            "link": null,
            "taughtWith": null
        },
        "354": {
            "name": "Form and Technique in Fiction",
            "credits": "3 Credits (3)",
            "description": "Literature course designed for fiction writers, especially those English majors in the Creative Writing emphasis. The course combines the study of published fiction with the study of craft. Some of the assignments will require the student to write original fiction based on exercises provided by the instructor. Repeatable for up to 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "356": {
            "name": "Form and Technique in Poetry",
            "credits": "3 Credits (3)",
            "description": "Literature course designed for poets, especially those English majors in the Creative Writing emphasis. The course combines the study of published poetry with the study of craft. Some of the assignments will require the student to write original poems based on exercises provided by the instructor. Repeatable for up to 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "358": {
            "name": "Form and Technique in Playwriting",
            "credits": "3 Credits (3)",
            "description": "Literature course designed for playwrights, especially those English majors in the Creative Writing emphasis. The course combines the study of published plays and performances with the study of craft. Some of the assignments will require the student to write original plays based on exercises provided by the instructor. Repeatable up to 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "363": {
            "name": "Literature for Children and Young Adults",
            "credits": "3 Credits (3)",
            "description": "A comparative, historical survey of literature for young (K to 12th grade) readers. Emphasis on critical evaluation. ",
            "link": null,
            "taughtWith": null
        },
        "380": {
            "name": "Women Writers",
            "credits": "3 Credits (3)",
            "description": "Introduction to multicultural women's traditions through intensive study of works by women writers. Crosslisted with: GNDR380V.",
            "link": null,
            "taughtWith": null
        },
        "392": {
            "name": "Mythology",
            "credits": "3 Credits (3)",
            "description": "Greek and Roman mythology and its impact on European and English literature. Readings in myths, classical plays, and other literature with mythological interest, including nonclassical myths.",
            "link": null,
            "taughtWith": null
        },
        "394": {
            "name": "Southwestern Literature",
            "credits": "3 Credits (3)",
            "description": "Introduction to multicultural literature of the Southwest: oral folk literature, literary fiction (classic and contemporary), nonfiction and poetry.",
            "link": null,
            "taughtWith": null
        },
        "399": {
            "name": "Special Topics",
            "credits": "3 Credits (3)",
            "description": "Emphasis on a theme, genre, figure, or technique chosen for study during the semester. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "400": {
            "name": "Independent Study: Upper Division",
            "credits": "1-3 Credits",
            "description": "For students with demonstrated aptitude for independent work. Approval of instructor required before registration. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "403": {
            "name": "Web Design and Development",
            "credits": "3 Credits (3)",
            "description": "Combines study and practice of web design and development as rhetoric, technical, processual, and collaborative.",
            "link": null,
            "taughtWith": null
        },
        "404": {
            "name": "User Experience and Assistance",
            "credits": "3 Credits (3)",
            "description": "Includes theories and discussions of users, usability, accessibility, disability, design, embodiment, and ethics to prepare students to understand, write for, and collaborate with users and audiences in technical and professional communication contexts.",
            "link": null,
            "taughtWith": null
        },
        "405": {
            "name": "Chaucer",
            "credits": "3 Credits (3)",
            "description": "Principal works, with emphasis on The Canterbury Tales.",
            "link": null,
            "taughtWith": null
        },
        "407": {
            "name": "Milton",
            "credits": "3 Credits (3)",
            "description": "Studies in Milton's works, including Paradise Lost.",
            "link": null,
            "taughtWith": null
        },
        "408": {
            "name": "Shakespeare I",
            "credits": "3 Credits (3)",
            "description": "Study in Shakespeare’s early poems and plays. Repeatable for up to six credits under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "409": {
            "name": "Shakespeare II",
            "credits": "3 Credits (3)",
            "description": "Study in Shakespeare's later plays. ENGL408 is not a prerequisite. Repeatable for up to six credits under different subtitles. Crosslisted with THEA409.",
            "link": null,
            "taughtWith": null
        },
        "412": {
            "name": "Writing in the Workplace",
            "credits": "3 Credits (3)",
            "description": "Study of workplace writing practices, including a focus on research-based, theoretical, and pedagogical approaches to professional communication. ",
            "link": null,
            "taughtWith": null
        },
        "413": {
            "name": "Advanced Creative Writing: Prose Workshop",
            "credits": "3 Credits (3)",
            "description": "Imaginative writing, chiefly the narrative. May be repeated up to 12 credits.  ",
            "link": null,
            "taughtWith": null
        },
        "414": {
            "name": "Advanced Creative Writing: Poetry Workshop",
            "credits": "3 Credits (3)",
            "description": "For advanced writers of poetry. Repeatable for a total of 12 credits. ",
            "link": null,
            "taughtWith": null
        },
        "416": {
            "name": "Approaches to Literature",
            "credits": "3 Credits (3)",
            "description": "Understanding, appreciation, techniques of instruction in the high school. ",
            "link": null,
            "taughtWith": null
        },
        "417": {
            "name": "Advanced Study in Critical Theory",
            "credits": "3 Credits (3)",
            "description": "Advanced study of one or more major trends in theoretical inquiry within English studies. Some prior study of theory, such as English 301-303, strongly recommended. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "418": {
            "name": "History of Rhetoric",
            "credits": "3 Credits (3)",
            "description": "Investigation of crucial writings that have shaped Western attitudes towards and practice of rhetoric. Will examine key concepts from the Greeks through the Enlightenment, especially as they have influenced contemporary rhetorical theory.",
            "link": null,
            "taughtWith": null
        },
        "419": {
            "name": "Modern Rhetorical Theory",
            "credits": "3 Credits (3)",
            "description": "Major figures in rhetorical theory, with particular emphasis on developments in rhetorical theory in the twentieth century.",
            "link": null,
            "taughtWith": null
        },
        "422": {
            "name": "Advanced Study in a Literary Form or Genre",
            "credits": "3 Credits (3)",
            "description": "Close study of a topic in a particular literary form or genre. May be repeated under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "423": {
            "name": "Advanced Study in a Major Author",
            "credits": "3 Credits (3)",
            "description": "Close study of selected works by a major author. May be repeated under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "424": {
            "name": "Advanced Study in a Major Text",
            "credits": "3 Credits (3)",
            "description": "Close study of a major text. Course subtitled in the Schedule of Classes. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "430": {
            "name": "Online Publishing",
            "credits": "3 Credits (3)",
            "description": "This three-credit course provides a theoretical background for online publishing and design as well as hands on experience publishing an online arts magazine.",
            "link": null,
            "taughtWith": null
        },
        "431": {
            "name": "Technical Editing",
            "credits": "3 Credits (3)",
            "description": "Uses workshops, readings, hands-on projects, and discussion to improve skills in gathering, writing, designing, and editing technical information. For students interested in technical communication as well as students interested in developing strengths in communicating in scientific and technical fields.",
            "link": null,
            "taughtWith": null
        },
        "433": {
            "name": "Victorian Literature",
            "credits": "3 Credits (3)",
            "description": "Intensive study of major writers and critical topics from the Victorian period.  Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "442": {
            "name": "Modern and Contemporary American Poetry",
            "credits": "3 Credits (3)",
            "description": "Studies the development of American poetry from World War I to the present. Repeatable under a different subtitle. May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "445": {
            "name": "Postmodern Fiction",
            "credits": "3 Credits (3)",
            "description": "Study of the various forms of formally innovative experimental fiction produced since 1945, with a focus on the relationship between literary history and its sociohistorical contexts.  Some texts will be read in translation. Repeatable under different subtitles. May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "446": {
            "name": "Advanced Creative Writing: Nonfiction Prose",
            "credits": "3 Credits (3)",
            "description": "This workshop-format class for advanced writers will examine the many varieties of Creative Nonfiction. Students should be prepared for a rigorous reading load of published nonfiction and student submissions. Because of the workshop format, every student is expected to contribute extensively to every class, both in printed form and oral comments.   May be repeated up to 12 credits. ",
            "link": null,
            "taughtWith": 546
        },
        "449": {
            "name": "Advanced Study in Writing",
            "credits": "3 Credits (3)",
            "description": "Close study of a topic in composition, rhetoric and/or technical and professional communication. Repeatable for a maximum of 6 credits with permission of department.",
            "link": null,
            "taughtWith": null
        },
        "453": {
            "name": "World Literatures",
            "credits": "3 Credits (3)",
            "description": "Study of one or more literary traditions exclusive of those originating in Europe and the United States. Readings will include texts in translation.  Repeatable under different subtitles. May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "458": {
            "name": "Latino/a Literature and Culture",
            "credits": "3 Credits (3)",
            "description": "Focuses on established and emergent Latino/a literary and cultural production. Incorporates both literary and sociocultural readings of texts. Repeatable under different subtitles.  May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "460": {
            "name": "Proposal Writing",
            "credits": "3 Credits (3)",
            "description": "Developing proposals and grants in a workshop setting.",
            "link": null,
            "taughtWith": null
        },
        "469": {
            "name": "Advanced Study in American Literature",
            "credits": "3 Credits (3)",
            "description": "Covers selected works for a particular period of American literary history. Repeatable under different subtitles. ",
            "link": null,
            "taughtWith": null
        },
        "470": {
            "name": "Approaches to Composition",
            "credits": "3 Credits (3)",
            "description": "Theory and practice of teaching writing. Discussion and application of classroom practices, definition of standards, and evaluation of student writing.",
            "link": null,
            "taughtWith": null
        },
        "471": {
            "name": "Scholarly Writing for International Graduate Students",
            "credits": "3 Credits (3)",
            "description": "Instruction and practice in writing major academic genres, including experimental, descriptive, and problem-solution research reports, proposals, and library referenced papers. May be repeated up to 3 credits.  Graded: S/U Grading (S/U, Audit).",
            "link": null,
            "taughtWith": null
        },
        "478": {
            "name": "Document Design",
            "credits": "3 Credits (3)",
            "description": "Advanced study in writing, with an emphasis on the computer as a tool for designing visually informative text. Includes theory and research in document design and the use of page composition and graphics software.",
            "link": null,
            "taughtWith": null
        },
        "479": {
            "name": "Computers and Writing",
            "credits": "3 Credits (3)",
            "description": "This course will trace the history of computers and composition as a field by looking at the work of important scholars including Selfe, Hawisher, Johnson-Eilola, and Wysocki. We will then focus on specific ways new media might be integrated into composition classrooms. The course will include discussions, student facilitations, and experimentation with technologies. ",
            "link": null,
            "taughtWith": null
        },
        "481": {
            "name": "Women's Literature",
            "credits": "3 Credits (3)",
            "description": "Intensive study of literature by women, in particular historical, aesthetic, cultural, or intellectual contexts. Repeatable under different subtitles. Crosslisted with: GNDR484",
            "link": null,
            "taughtWith": null
        },
        "489": {
            "name": "Cultural Studies: Literature and Theory",
            "credits": "3 Credits (3)",
            "description": "Examines the theory and practice of cultural studies in relation to the variety of discourse describable as literary, including autobiography, avant-garde writing, nonfiction prose, the essay, online writing, folklore, and popular genre fiction (such as mystery, romance, thriller, or horror).  Repeatable under different subtitles. May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "497": {
            "name": "Internship",
            "credits": "3-6 Credits (3-6)",
            "description": "Supervised technical and professional communication internship in business, industry, government, or the university. Repeatable for a total of 6 credits. Consent of instructor required.",
            "link": null,
            "taughtWith": null
        },
        "500": {
            "name": "Supervised Study",
            "credits": "1-3 Credits",
            "description": "To prepare the student for the master s degree examinations by special studies in fields not covered in routine course work. ",
            "link": null,
            "taughtWith": null
        },
        "501": {
            "name": "Online Publishing",
            "credits": "3 Credits (3)",
            "description": "This three-credit course provides a theoretical background for online publishing and design as well as hands-on experience publishing an online arts magazine.  ",
            "link": 430,
            "taughtWith": null
        },
        "502": {
            "name": "Critical Conversations in Technical and Professional Communication",
            "credits": "3 Credits (3)",
            "description": "Introduces students to critical histories, theories, and key concepts in technical and professional communication across academic and industry boundaries.",
            "link": null,
            "taughtWith": null
        },
        "503": {
            "name": "Web Design and Development",
            "credits": "3 Credits (3)",
            "description": "Combines study and practice of web design and development as rhetorical, technical, processual, and collaborative.",
            "link": null,
            "taughtWith": null
        },
        "504": {
            "name": "User Experience and Assistance",
            "credits": "3 Credits (3)",
            "description": "Includes theories and discussions of users, usability, accessibility, disability, design, embodiment, and ethics to prepare students to understand, write for, and collaborate with users and audiences in technical and professional communication contexts.",
            "link": null,
            "taughtWith": null
        },
        "505": {
            "name": "Graduate Study in Chaucer",
            "credits": "3 Credits (3)",
            "description": "Principal works, with emphasis on the Canterbury Tales. Requirements include independent directed research.  May be repeated up to 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "507": {
            "name": "Special Topics in Rhetoric and Technical and Professional Communication",
            "credits": "3 Credits (3)",
            "description": "Seminar course centered on contemporary issues in rhetoric and technical and professional communication. Repeatable under different subtitles, for up to 6 credits.",
            "link": null,
            "taughtWith": null
        },
        "508": {
            "name": "Graduate Study in Shakespeare I",
            "credits": "3 Credits (3)",
            "description": "Graduate study in Shakespeare's early poems and plays. Requirements include independent directed research. Repeatable for up to six credits under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "509": {
            "name": "Graduate Study in Shakespeare II",
            "credits": "3 Credits (3)",
            "description": "Study in Shakespeare’s late poems and plays. Requirements include independent directed research. Repeatable for up to six credits under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "510": {
            "name": "Proseminar in Rhetoric and Professional Communication",
            "credits": "3 Credits (3)",
            "description": "Introduction to research in rhetoric and professional communication. ",
            "link": null,
            "taughtWith": 610
        },
        "512": {
            "name": "Graduate Study in Writing in the Workplace",
            "credits": "3 Credits (3)",
            "description": "Study of workplace writing practices, including a focus on research-based, theoretical, and pedagogical approaches to professional communication. ",
            "link": null,
            "taughtWith": null
        },
        "513": {
            "name": "Creative Writing Workshop: Fiction",
            "credits": "3 Credits (3)",
            "description": "Advanced creative writing prose workshop. Imaginative writing, chiefly the narrative. Graduate level workshop for students who are not in the English Department MFA program. May be repeated for a maximum of 12 credits. Taught with ENGL413 with additional work required at the graduate level.",
            "link": 413,
            "taughtWith": null
        },
        "514": {
            "name": "Creative Writing Workshop: Poetry",
            "credits": "3 Credits (3)",
            "description": "Creative writing poetry workshop for advanced writers of poetry. Graduate level works for students who are not in the English Department MFA program. Repeatable for a maximum of 12 credits. Taught with ENGL414 with additional work required at the graduate level.",
            "link": 414,
            "taughtWith": null
        },
        "516": {
            "name": "Graduate Study in Approaches to Literature",
            "credits": "3 Credits (3)",
            "description": "Understanding, appreciation, techniques of instruction in the high school. Requirements include independent directed research. ",
            "link": null,
            "taughtWith": null
        },
        "517": {
            "name": "Graduate Study in Critical Theory",
            "credits": "3 Credits (3)",
            "description": "Advanced study of one or more major trends in theoretical inquiry within English studies. Some prior study of theory, such as English 301, 302, or 303, strongly recommended. Repeatable under different subtitles. ",
            "link": null,
            "taughtWith": null
        },
        "518": {
            "name": "History of Rhetoric",
            "credits": "3 Credits (3)",
            "description": "An investigation of the crucial writings that have shaped Western attitudes towards and practice of rhetoric. Course will examine key texts from the Greeks through the Enlightenment, especially as they have influenced contemporary rhetorical theory.",
            "link": null,
            "taughtWith": null
        },
        "519": {
            "name": "Graduate Study in Modern Rhetorical Theory",
            "credits": "3 Credits (3)",
            "description": "Major figures in rhetorical theory, with particular emphasis on developments in rhetorical theory in the 20th century. Students will be responsible for all requirements of ENGL419 and will in addition undertake independent directed research.",
            "link": null,
            "taughtWith": null
        },
        "521": {
            "name": "Graduate Study in a Literary Period or Movement",
            "credits": "3 Credits (3)",
            "description": "Close study of a topic in a particular literary period or movement. Requirements include independent directed research. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "522": {
            "name": "Graduate Study in a Literary Form or Genre",
            "credits": "3 Credits (3)",
            "description": "Close study of a topic in a particular literary form or genre. Requirements include independent directed research. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "523": {
            "name": "Graduate Study of a Major Author",
            "credits": "3 Credits (3)",
            "description": "Close study of selected works of a major author. Requirements include independent directed research. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "524": {
            "name": "Graduate Study in a Major Text",
            "credits": "3 Credits (3)",
            "description": "Close study of a major text. Requirements include independent directed research. Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "525": {
            "name": "Graduate Study in Comparative Literature",
            "credits": "3 Credits (3)",
            "description": "Close study of a selection on non-English literary works read in translation. English-language works from a similar literary period or genre may also be read. Requirements include independent directed research.  Repeatable under different subtitles.",
            "link": null,
            "taughtWith": null
        },
        "526": {
            "name": "Special Topics in Critical Theory",
            "credits": "3 Credits (3)",
            "description": "Study of a specific historical or theoretical topic, trend, or movement in Critical Theory. Repeatable under different subtitles. ",
            "link": null,
            "taughtWith": null
        },
        "527": {
            "name": "Graduate Study in Film and Digital Media",
            "credits": "3 Credits (3)",
            "description": "Offers close graduate study of a form or genre, a major figure or style, a historical period or movement, or a major theme or text. Topics vary from semester to semester.  ",
            "link": null,
            "taughtWith": null
        },
        "529": {
            "name": "British Romanticism",
            "credits": "3 Credits (3)",
            "description": "Intensive study of major writers and critical topics from the Romantic period.  Repeatable under different subtitles. ",
            "link": null,
            "taughtWith": null
        },
        "531": {
            "name": "Technical Editing",
            "credits": "3 Credits (3)",
            "description": "Uses workshops, readings, hands-on projects, and discussion to improve skills in gathering, writing, designing, and editing technical information. For students interested in technical communication as well as students interested in developing strengths in communicating in scientific and technical fields.",
            "link": null,
            "taughtWith": null
        },
        "533": {
            "name": "Victorian Literature",
            "credits": "3 Credits (3)",
            "description": "Intensive study of major writers and critical topics from the Victorian period.  Repeatable under different subtitles. ",
            "link": null,
            "taughtWith": null
        },
        "534": {
            "name": "Graduate Study: Form and Technique in Fiction",
            "credits": "3 Credits (3)",
            "description": "Advanced study of issues in form and technique in fiction, including point of view, scene and dialogue, and story structure. Repeatable for a maximum of 6 credits.",
            "link": null,
            "taughtWith": null
        },
        "535": {
            "name": "Graduate Study: Form and Technique in Poetry",
            "credits": "3 Credits (3)",
            "description": "Advanced study of issues in form and technique in poetry, including voice, tone, syntax, and structure. Repeatable for a maximum of 12 credits.",
            "link": null,
            "taughtWith": null
        },
        "536": {
            "name": "The Borderlands Writing Project",
            "credits": "3-6 Credits (3-6)",
            "description": "Intensive month-long seminar for practicing teachers and educators designed to improve the teaching of writing and the writing process and literacy and reading in schools and other educational contexts. Reading, discussing, and writing about current professional literature; completing teacher inquiry; and planning action research. Participants complete personal and professional writing, as well as additional professional development activities. By invitation only. Affiliated with the National Writing Project. Consent of instructor required.  Crosslisted with: RDG536",
            "link": null,
            "taughtWith": null
        },
        "542": {
            "name": "Modern and Contemporary American Poetry",
            "credits": "3 Credits (3)",
            "description": "Studies the development of American poetry from World War I to the present. Repeatable under different subtitles.  May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "543": {
            "name": "Multimedia Theory and Production",
            "credits": "3 Credits (3)",
            "description": "Issues, theories, and production practices underlying design of multimedia, including rhetorical choices, aesthetic approaches, usability concerns, and diverse academic and popular discourses contributing to continued development of digital texts. ",
            "link": null,
            "taughtWith": 643
        },
        "544": {
            "name": "Modern British Fiction",
            "credits": "3 Credits (3)",
            "description": "Study of the fiction produced in the British Isles in the 20th and 21st centuries.  Repeatable under different subtitles. May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "545": {
            "name": "Postmodern Fiction",
            "credits": "3 Credits (3)",
            "description": "Study of the various forms of formally innovative experimental fiction produced since 1945, with a focus on the relationship between literary history and its sociohistorical contexts.  Some texts will be read in translation. Repeatable under different subtitles.   May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "546": {
            "name": "Advanced  Creative Writing: Nonfiction Prose",
            "credits": "3 Credits (3)",
            "description": "This graduate-level workshop will examine the many varieties of Creative Nonfiction. Students should be prepared for a rigorous reading load of published nonfiction and student submissions. Because of the workshop format, every student is expected to contribute extensively to every class, both in printed form and oral comments. Taught with ENGL446 with additional work required at the graduate level.  Consent of Instructor required. Crosslisted with: ENGL446. ",
            "link": 446,
            "taughtWith": null
        },
        "548": {
            "name": "Graduate Study in Empirical Research",
            "credits": "3 Credits (3)",
            "description": "Introduction to empirical research methods in composition, professional communication, and rhetoric. ",
            "link": null,
            "taughtWith": null
        },
        "549": {
            "name": "Graduate Study in Writing",
            "credits": "3 Credits (3)",
            "description": "Close study of a topic in composition, rhetoric, and/or technical and professional communication. Topics vary. Repeatable for a maximum of 6 credits.",
            "link": null,
            "taughtWith": null
        },
        "550": {
            "name": "Graduate Study in Literacy",
            "credits": "3 Credits (3)",
            "description": "Studies in literacy theory and literacy research. Topics may vary. ",
            "link": null,
            "taughtWith": 650
        },
        "552": {
            "name": "Graduate Study in History of the English Language",
            "credits": "3 Credits (3)",
            "description": "This course examines the history of the English language from its Indo-European origins through its development into an international language. The aim is to describe the English language formally and to trace linguistic change over time. Samples of written English will illustrate various stages in the development of English. Also considered are contemporary social and political issues related to language, including the problem of 'standard English' and the uses of language in advertising, the media, and politics.",
            "link": null,
            "taughtWith": null
        },
        "553": {
            "name": "World Literatures",
            "credits": "3 Credits (3)",
            "description": "Study of one or more literary traditions exclusive of those originating in Europe and the United States. Readings will include texts in translation.  Repeatable under different subtitles.  May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "555": {
            "name": "Graduate Study in Rhetoric of Scientific Literature",
            "credits": "3 Credits (3)",
            "description": "Intensive study of the rhetoric of selected works of scientific literature.",
            "link": null,
            "taughtWith": null
        },
        "558": {
            "name": "Latino/a Literature and Culture",
            "credits": "3 Credits (3)",
            "description": "Focuses on established and emergent Latino/a literary and cultural production. Incorporates both literary and sociocultural readings of texts. Repeatable under different subtitles.  May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "559": {
            "name": "Black Literature and Culture in the United States",
            "credits": "3 Credits (3)",
            "description": "Focuses on established and emergent Black U.S. literary and cultural production. Incorporates both literary and sociocultural readings of texts. Repeatable under different subtitles.  May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "560": {
            "name": "Proposal and Grant Writing",
            "credits": "3 Credits (3)",
            "description": "Developing proposals and grants in a workshop setting.",
            "link": null,
            "taughtWith": null
        },
        "561": {
            "name": "Topics in Writing Program Administration",
            "credits": "3 Credits (3)",
            "description": "Explores issues, theories, and research underlying the design of writing programs and the administration of writing centers. Repeatable for a maximum of 6 credits. ",
            "link": null,
            "taughtWith": 661
        },
        "562": {
            "name": "Interdisciplinary, Client-Based Project Practicum",
            "credits": "3 Credits (3)",
            "description": "Hands-on experience in collaborating within interdisciplinary teams designing projects for organizational clients. ",
            "link": 462,
            "taughtWith": null
        },
        "563": {
            "name": "Graduate Study in English Literature",
            "credits": "3 Credits (3)",
            "description": "Covers selected works for a particular period of English literary history. Repeatable under different subtitles. ",
            "link": null,
            "taughtWith": null
        },
        "564": {
            "name": "History and Theory of Composition Studies",
            "credits": "3 Credits (3)",
            "description": "Studies in the history and theory of composition as a discipline. ",
            "link": null,
            "taughtWith": 664
        },
        "565": {
            "name": "Intercultural Rhetoric and Professional Communication",
            "credits": "3 Credits (3)",
            "description": "Examines rhetorical traditions in intercultural professional, technical, academic, and governmental contexts. ",
            "link": null,
            "taughtWith": 665
        },
        "567": {
            "name": "Documentary Film Theory and Criticism",
            "credits": "3 Credits (3+3P)",
            "description": "Course offers critical survey of documentary film theory and criticism including considerations of the epistemological assumptions, rhetorical choices, aesthetic approaches, political circumstances of historical and contemporary documentary film.",
            "link": null,
            "taughtWith": null
        },
        "568": {
            "name": "Rhetoric and Cultural Studies",
            "credits": "3 Credits (3)",
            "description": "Explores intersections between rhetoric and cultural studies. Examines theories and practices of texts and discourses in political and cultural contexts. ",
            "link": null,
            "taughtWith": 668
        },
        "569": {
            "name": "Graduate in American Literature",
            "credits": "3 Credits (3)",
            "description": "A group of works from a particular period of American literary history. Repeatable under different subtitles. ",
            "link": null,
            "taughtWith": null
        },
        "570": {
            "name": "Graduate Study in Approaches to Composition",
            "credits": "3 Credits (3)",
            "description": "Theory and practice of teaching writing, including classroom practices, definition of standards, and evaluation of student writing. Requirements include independent directed research.",
            "link": null,
            "taughtWith": null
        },
        "571": {
            "name": "Composition Pedagogy and Practicum",
            "credits": "3 Credits (3)",
            "description": "Examines the pedagogical implications of contemporary composition theory and research. Focuses on teaching composition at the college level. Consent of instructor required. ",
            "link": null,
            "taughtWith": null
        },
        "572": {
            "name": "Technical-Professional Communication Pedagogies",
            "credits": "3 Credits (3)",
            "description": "Combines theoretical and practical attention to the pedagogies that underwrite the teaching of technical and professional communication; culminates in the development of a TPC course proposal, syllabus, and rationale. For Graduate students only.",
            "link": null,
            "taughtWith": null
        },
        "574": {
            "name": "Workshop: Advanced Writing Prose",
            "credits": "3 Credits (3)",
            "description": "Intensive practice in prose writing, primarily fiction, in a workshop environment with peer criticism. Repeatable for a total of 15 credits. Consent of instructor required.",
            "link": null,
            "taughtWith": null
        },
        "575": {
            "name": "Workshop: Advanced Writing Poetry",
            "credits": "3 Credits (3)",
            "description": "Intensive practice in poetry writing in a workshop environment with peer criticism. Repeatable for a total of 15 credits. Consent of instructor required.",
            "link": null,
            "taughtWith": null
        },
        "576": {
            "name": "Workshop: Advanced Writing Playwriting",
            "credits": "3 Credits (3)",
            "description": "Intensive practice in dramatic writing in a workshop environment with peer criticism. Repeatable for a total of 9 credits. Consent of instructor required.",
            "link": null,
            "taughtWith": null
        },
        "577": {
            "name": "Workshop: Advanced Technical and Professional Writing",
            "credits": "3 Credits (3)",
            "description": "Intensive practice in technical and professional writing and editing in a workshop environment. May be repeated for a total of 6 credits. Consent of instructor required.",
            "link": null,
            "taughtWith": null
        },
        "578": {
            "name": "Topics in Rhetoric and Technology",
            "credits": "3 Credits (3)",
            "description": "Explores intersections between rhetoric and technology, approaches may highlight theory, media production, and/or research. Repeatable for a maximum of 6 credits. ",
            "link": null,
            "taughtWith": 678
        },
        "579": {
            "name": "Computers and Writing",
            "credits": "3 Credits (3)",
            "description": "This course will trace the history of computers and composition as a field by looking at the work of important scholars including Selfe, Hawisher, Johnson-Eilola, and Wysocki. We will then focus on specific ways new media might be integrated into composition classrooms. The course will include discussions, student facilitations, and experimentation with technologies. ",
            "link": null,
            "taughtWith": null
        },
        "580": {
            "name": "Graduate Problems in Creative Writing",
            "credits": "3 Credits (3)",
            "description": "Independent study in creative writing. Consent of instructor required. Repeatable for a total of 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "581": {
            "name": "Women's Literature",
            "credits": "3 Credits (3)",
            "description": "Intensive study of literature by women, in particular historical, aesthetic, cultural, or intellectual contexts. Repeatable under different subtitles. Crosslisted with: GNDR584",
            "link": null,
            "taughtWith": null
        },
        "582": {
            "name": "Gender and Popular Culture",
            "credits": "3 Credits (3)",
            "description": "Intensive study of the representations of gender in popular culture. Examines the historical, aesthetic, and cultural contexts of these representation and the various critical and theoretical lenses we use to understand them. Repeatable under different subtitles. Crosslisted with: GNDR582",
            "link": null,
            "taughtWith": null
        },
        "583": {
            "name": "Critical Writing Studies",
            "credits": "3 Credits (3)",
            "description": "Overview of current and historical approaches to the critical study of gender and language: how gender theoretically manifests in linguistic, social, cultural, academic, and professional contexts. ",
            "link": null,
            "taughtWith": null
        },
        "584": {
            "name": "Workshop: Advanced Academic Writing for International Students",
            "credits": "3 Credits (3)",
            "description": "This workshop-based course is for graduate-level multilingual writers from all disciplines who want to improve their English academic writing in an intensive and collaborative environment. Students will propose a major writing project to workshop throughout the semester, such as dissertation, thesis, comprehensive exams, etc. Some of the topics covered will be academic language, cohesion/coherence, organization, and supporting academic arguments. Other topics to be determined by needs of the class. )  4.Consent of instructor.",
            "link": null,
            "taughtWith": null
        },
        "585": {
            "name": "Advanced Writing Workshop: RPC Capstone",
            "credits": "3 Credits (3)",
            "description": "Students work to develop and revise their chosen Master's program Capstone Project (a portfolio, thesis or master essay) in consultation with instructor and classmates. Students provide and receive feedback on their work-in-progress. Consent of Instructor required. ",
            "link": null,
            "taughtWith": null
        },
        "589": {
            "name": "Cultural Studies: Literature and Theory",
            "credits": "3 Credits (3)",
            "description": "Examines the theory and practice of cultural studies in relation to the variety of discourse describable as literary, including autobiography, avant-garde writing, nonfiction prose, the essay, online writing, folklore, and popular genre fiction (such as mystery, romance, thriller, or horror).  Repeatable under different subtitles. May be repeated up to 6 credits. ",
            "link": null,
            "taughtWith": null
        },
        "590": {
            "name": "Master's Seminar in Rhetoric",
            "credits": "3 Credits (3)",
            "description": "Studies in theories of and issues in rhetoric. Topics may vary from year to year. Repeatable for a total of 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "591": {
            "name": "Graduate Screenwriting",
            "credits": "3 Credits (3)",
            "description": "Students will prepare a feature-length screenplay. Script analysis will be in an advanced workshop format. Scripts will be read and discussed, scenes performed and reactions analyzed to consider effect of dialogue, character development, etc. Aimed at preparing writers for the professional market. Consent of instructor required.",
            "link": null,
            "taughtWith": null
        },
        "592": {
            "name": "Master's Theory, Practice, and Profession",
            "credits": "3 Credits (3)",
            "description": "Students will study major poetics/narratology pieces in the field and other related professional topics such as literary citizenship, publishing, and job seeking skills. Students will also propose and develop a year-long project in one of the above categories, such as a community reading or workshop, a conference panel proposal, a paper presentation, a chapbook press launch, writing/placing literary book reviews, or work on an outreach project. Must be taken in each of the last two semesters of the MFA and currently with ENGL594 (Master's Workshop). Restricted to MFA-Creative Writing students, or by consent of instructor.",
            "link": null,
            "taughtWith": null
        },
        "594": {
            "name": "Master's Workshop",
            "credits": "3 Credits (3)",
            "description": "Students will submit a draft of their thesis project, in their major genre, for workshop critique. Revision of the thesis draft will be submitted to the instructor. Restricted to MFA Creative Writing students, or by consent of instructor. Must be taken in each of the last two semesters of the MFA, and concurrently with ENGL592 (Master's Theory, Practice, and Profession).",
            "link": null,
            "taughtWith": null
        },
        "595": {
            "name": "Master's Workshop: Poetry",
            "credits": "3-6 Credits (3-6)",
            "description": "Students will submit a draft of thesis project for workshop critique. Revision of the thesis draft submitted to the instructor.   Restricted to MFA CW majors.",
            "link": null,
            "taughtWith": null
        },
        "596": {
            "name": "Master's Workshop: Fiction",
            "credits": "3-6 Credits (3)",
            "description": "Students will submit a draft of thesis project for workshop critique. Revision of the thesis draft submitted to the instructor.  Restricted to MFA CW majors.",
            "link": null,
            "taughtWith": null
        },
        "597": {
            "name": "Internship in Technical and Professional Communication",
            "credits": "3-6 Credits (3-6)",
            "description": "Supervised technical and professional communication in business, industry, government, or the university.  May be repeated for a total of 6 credits. Consent of instructor required.  ",
            "link": null,
            "taughtWith": null
        },
        "598": {
            "name": "Master's Essay",
            "credits": "3 Credits (3)",
            "description": "Students electing the master essay option complete revision of a scholarly essay of 25-30 pages, the approximate length of a journal article, and reformulation of this essay to the 7-8 pages appropriate for presentation at a conference. This option also requires research of appropriate publication venues and a final oral defense of the project. A supervising faculty member will approve the selected essay, guide revision, and help students form an examining committee, which consists of at least two members of the graduate English faculty and one member of the graduate faculty from outside the department. Students are encouraged to undertake the Master Essay process in the first half of their third semester of full time graduate work, or soon after completing 18 hours of course work. This option is the preferred exam option, particularly for those students who intend to pursue Ph.D. study. Consent of instructor required.",
            "link": null,
            "taughtWith": null
        },
        "599": {
            "name": "Master's Thesis",
            "credits": "1-15 Credits",
            "description": "Thesis.",
            "link": null,
            "taughtWith": null
        },
        "600": {
            "name": "Doctoral Research",
            "credits": "1-15 Credits",
            "description": "Assigns credit for research performed prior to the doctoral comprehensive examination.",
            "link": null,
            "taughtWith": null
        },
        "601": {
            "name": "Qualitative Research",
            "credits": "3 Credits (3)",
            "description": "Theory and practice of designing research studies and of collecting and analyzing data. Emphasis on qualitative methods of research in composition, professional communication, and rhetoric. ",
            "link": null,
            "taughtWith": null
        },
        "602": {
            "name": "Quantitative Research",
            "credits": "3 Credits (3)",
            "description": "Theory and practice of designing quantitative research studies and of collecting and analyzing data. Emphasis on quantitative methods of research in composition, professional communication, and rhetoric. ",
            "link": null,
            "taughtWith": null
        },
        "603": {
            "name": "Rhetorical Criticism and Methodology",
            "credits": "3 Credits (3)",
            "description": "Theory and practice of designing research studies and of collecting and analyzing data. Emphasis on methods of rhetorical criticism.",
            "link": null,
            "taughtWith": null
        },
        "604": {
            "name": "Digital Research Methods",
            "credits": "3 Credits (3)",
            "description": "This course will serve as one of the core methods courses in the RPC PhD program, focusing on “digital” methods in rhetorical studies. As such, the aim of this class is to help you begin to gain confidence in conducting research in rhetoric, professional communication, and composition using digital methods. In this course we will assume that digital methods in rhetoric take broadly two forms: first, digital methods of acquisition, processing, and presentation of research data. And second, digital methods of production and circulation of rhetorical objects. The former closely resembles the methods of “digital humanities” while the latter will be closer to media archaeology and “critical making” practices. In all cases, we will relate these tools and methods to key questions and theories in our field, asking how and why we might apply digital methods in rhetorical scholarship.   ",
            "link": null,
            "taughtWith": null
        },
        "610": {
            "name": "Proseminar in Rhetoric and Professional Communication",
            "credits": "3 Credits (3)",
            "description": "Introduction to research in rhetoric and professional communication. Required of and limited to students enrolled in the Ph.D. program in Rhetoric and Professional Communication.",
            "link": null,
            "taughtWith": null
        },
        "643": {
            "name": "Multimedia Theory and Production",
            "credits": "3 Credits (3)",
            "description": "Issues, theories, and production practices underlying design of multimedia, including rhetorical choices, aesthetic approaches, usability concerns, and diverse academic and popular discourses contributing to continued development of digital texts. ",
            "link": 543,
            "taughtWith": null
        },
        "646": {
            "name": "Teaching Rhetoric and Writing with English Language Learners",
            "credits": "3 Credits (3)",
            "description": "This course introduces students to the rich interdisciplinary world of writing for English language learners with the goal of helping researchers and instructors understand the unique characteristics and needs of ELL writers. It also examines Generation 1.5, bilingualism, and Spanish-dominant writers along the U.S.-Mexico Border.  The course prepares students to work with ELL writing in curriculum design, needs analysis, classroom implementation, assessment, writing program administration, and institutional policies.  The course will be a requirement for those GAs seeking to teach experimental sections of first-year multilingual composition at NMSU.  ",
            "link": null,
            "taughtWith": null
        },
        "649": {
            "name": "Graduate Study in Writing",
            "credits": "3 Credits (3)",
            "description": "Close study of a topic in composition, rhetoric, and/or technical and profession communication. Repeatable for a total of 6 credits.",
            "link": null,
            "taughtWith": null
        },
        "650": {
            "name": "Graduate Study in Literacy",
            "credits": "3 Credits (3)",
            "description": "Studies in literacy theory and literacy research. Topics may vary. ",
            "link": 550,
            "taughtWith": null
        },
        "661": {
            "name": "Topics in Writing Program Administration",
            "credits": "3 Credits (3)",
            "description": "Explores issues, theories, and research underlying writing programs and the administration of writing centers. Repeatable for a maximum of 6 credits. ",
            "link": 561,
            "taughtWith": null
        },
        "664": {
            "name": "History and Theory of Composition Studies",
            "credits": "3 Credits (3)",
            "description": "Studies in the history and theory of composition as a discipline. ",
            "link": 564,
            "taughtWith": null
        },
        "665": {
            "name": "Intercultural Rhetoric and Professional Communication",
            "credits": "3 Credits (3)",
            "description": "Examines rhetorical traditions in intercultural professional, technical, academic, and governmental contexts. ",
            "link": 565,
            "taughtWith": null
        },
        "668": {
            "name": "Rhetoric and Cultural Studies",
            "credits": "3 Credits (3)",
            "description": "Explores intersections between rhetoric and cultural studies. Examines theories and practices of texts and discourses in political and cultural contexts. ",
            "link": 568,
            "taughtWith": null
        },
        "678": {
            "name": "Topics in Rhetoric and Technology",
            "credits": "3 Credits (3)",
            "description": "Explores intersections between rhetoric and technology, approaches may highlight theory, media production, and/or research. Repeatable for a maximum of 6 credits. ",
            "link": 578,
            "taughtWith": null
        },
        "683": {
            "name": "Critical Writing Studies",
            "credits": "3 Credits (3)",
            "description": "This course investigates the field of Writing Studies as a distinct field of study, related to but not synonymous with Composition Studies. While debates surrounding the relationships among Writing Studies and Composition Studies flourish, this course centers on the former—investigating writing as a practice, process, and object that merits attention in its own right. Such attention will be grounded in contemporary critical and cultural theory that contests writing as a positive or neutral sign (i.e. activity theory, posthumanism, ecocriticism, new materialism, new media studies; feminist, queer, critical race or decolonial theory). Crosslisted with: ENGL583.  ",
            "link": null,
            "taughtWith": null
        },
        "690": {
            "name": "Doctoral Seminar in Rhetoric",
            "credits": "3 Credits (3)",
            "description": "Studies in theories of and issues in rhetoric. Topics may vary from year to year. Repeatable for a maximum of 9 credits.",
            "link": null,
            "taughtWith": null
        },
        "700": {
            "name": "Doctoral Dissertation",
            "credits": "1-15 Credits",
            "description": "Dissertation.",
            "link": null,
            "taughtWith": null
        },
        "1105": {
            "name": "Intermediate ESL Composition and Grammar Review",
            "credits": "3 Credits (3)",
            "description": "Development of fluent academic writing skills, with an emphasis on grammar review for editing purposes. May be repeated up to 3 credits.  Restricted to Las Cruces campus only.",
            "link": null,
            "taughtWith": null
        },
        "1110": {
            "name": "Composition I Multilingual",
            "credits": "4 Credits (4)",
            "description": "In this course, students will read, write, and think about a variety of issues and texts.They will develop reading and writing skills that will help with the writing required in their fields of study and other personal and professional contexts. Students will learn to analyze rhetorical situations in terms of audience, contexts, purpose, mediums, and technologies and apply this knowledge to their reading and writing. They will also gain an understanding of how writing and other modes of communication work together for rhetorical purposes. Students will learn to analyze the rhetorical context of any writing task and compose with purpose, audience, and genre in mind. Students will reflect on their own writing processes, learn to workshop drafts with other writers,and practice techniques for writing, revising, and editing. For international and multilingual students. Your instructor and classmates will serve as your readers and will give you helpful and constructive criticism, which will in turn assist you in becoming a more fluent and engaging communicator in English. Restricted to Las Cruces campus only. ",
            "link": null,
            "taughtWith": null
        },
        "1120": {
            "name": "Composition II",
            "credits": "2 Credits (2)",
            "description": "In this course, students will explore argument in multiple genres. Research and writing practices emphasize summary, analysis, evaluation, and integration of secondary sources. Students will analyze rhetorical situations in terms of audience, contexts, purpose, mediums, and technologies and apply this knowledge to their reading, writing, and research. Students will sharpen their understanding of how writing and other modes of communication work together for rhetorical purposes. The emphasis of this course will be on research methods. ",
            "link": null,
            "taughtWith": null
        },
        "1410": {
            "name": "Introduction to Literature",
            "credits": "3 Credits (3)",
            "description": "In this course, students will examine a variety of literary genres, including fiction, poetry, and drama. Students will identify common literary elements in each genre, understanding how specific elements influence meaning.",
            "link": null,
            "taughtWith": null
        },
        "2130": {
            "name": "Advanced Composition",
            "credits": "3 Credits (3)",
            "description": "This course is for students who are striving for fluency, maturity, clarity and significance in their writing. It is an intermediate writing course that builds on and refines writing skills acquired in previous courses. It focuses on non-fiction writing for the professions, business, science, technical fields, academe and/or the popular press. Short works of master writers are studied for ideas, styleand structure.",
            "link": null,
            "taughtWith": null
        },
        "2210": {
            "name": "Professional and Technical Communication for Multilingual Students",
            "credits": "3 Credits (3)",
            "description": "Professional and Technical Communication will introduce students to the different types of documents and correspondence that they will create in their professional careers. This course emphasizes the importance of audience, document design, and the use of technology in designing, developing, and delivering documents. This course will provide students with experience in professional correspondence and communicating technical information to a non-technical audience. NMSU specific description: In this course, students will explore the unique advantages and challenges of being multilingual writers. This course is designed for international and domestic multilingual students. ",
            "link": null,
            "taughtWith": null
        },
        "2215": {
            "name": "Advanced Technical and Professional Communication",
            "credits": "3 Credits (3)",
            "description": "Theory and practice of writing in technical and professional fields, individualized to each student s field. Emphasizes efficient writing processes and effective written products. May be repeated up to 3 credits.  Restricted to Las Cruces campus only.",
            "link": null,
            "taughtWith": null
        },
        "2221": {
            "name": "Writing in the Humanities and Social Science",
            "credits": "3 Credits (3)",
            "description": "Theory and practice in interpreting texts from various disciplines in the humanities and social sciences. Strategies for researching, evaluating, constructing, and writing researched arguments. Course subtitled in the Schedule of Classes. May be repeated up to 3 credits. ",
            "link": null,
            "taughtWith": null
        },
        "2280": {
            "name": "History of Argument",
            "credits": "3 Credits (3)",
            "description": "Investigates the major figures and movements in rhetoric from the classical period to modern rhetorical theory, examining relations between rhetorical teaching and practice, culture, epistemology, and ideology. Main campus only. Prerequisite(s): ENGL1110G, or ENGL 1110GH, or ENGL1110M",
            "link": null,
            "taughtWith": null
        },
        "2310": {
            "name": "Introduction to Creative Writing",
            "credits": "3 Credits (3)",
            "description": "This course will introduce students to the basic elements of creative writing, including short fiction, poetry, and creative nonfiction. Students will read and study published works as models, but the focus of this &quot;workshop&quot; course is on students revising and reflecting on their own writing. Throughout this course, students will be expected to read poetry, fiction, and nonfiction closely, and analyze the craft features employed. They will be expected to write frequently in each of these genres. ",
            "link": null,
            "taughtWith": null
        },
        "2381": {
            "name": "Script Development and Storyboarding",
            "credits": "3 Credits (3)",
            "description": "Examines effective writing principles for creating storyboards that communicate the overall picture of a project, timing, scene complexity, emotion and resource requirements. Crosslisted with: FDMA2381.",
            "link": null,
            "taughtWith": null
        },
        "2382": {
            "name": "Narrative: Principles of Story Across the Media",
            "credits": "3 Credits (3)",
            "description": "Examines the various strategies of written and visual storytelling, narrative structure and its principal components (plot, theme, character, imagery, symbolism, point of view) with an attempt to connect them to elements of contemporary forms of media expression, including screenwriting, playwriting, writing for documentaries and animation, etc. Crosslisted with: FDMA2382",
            "link": null,
            "taughtWith": null
        },
        "2520": {
            "name": "Film as Literature",
            "credits": "3 Credits (3+3P)",
            "description": "The purpose of this course is to teach students how to analyze film as a visual text. Students will learn to analyze films, film techniques, eras, and genres. Students will also identify significant trends and developments in film-making, examining the ways in which film reflects and creates cultural trends and values.",
            "link": null,
            "taughtWith": null
        },
        "2521": {
            "name": "The Bible as Literature",
            "credits": "3 Credits (3)",
            "description": "Develops informed readings of Hebrew and Christian scriptures. Emphasizes understanding Biblical literary forms, techniques, themes; historical, cultural contexts for interpretation; authorship, composition, audience for individual books; development of Biblical canon.",
            "link": null,
            "taughtWith": null
        },
        "2610": {
            "name": "American Literature I",
            "credits": "3 Credits (3)",
            "description": "This course surveys American literature from the colonial period to the mid-nineteenth century. This course provides students with the contexts and documents necessary to understand the origins of American Literature and the aesthetic, cultural, and ideological debates central to early American culture.",
            "link": null,
            "taughtWith": null
        },
        "2620": {
            "name": "American Literature II",
            "credits": "3 Credits (3)",
            "description": "This course surveys American literature from the mid-nineteenth-century to the contemporary period. This course provides students with the contexts and documents necessary to understand American literature and the aesthetic, cultural, and ideological debates central to American culture.",
            "link": null,
            "taughtWith": null
        },
        "2630": {
            "name": "British Literature I",
            "credits": "3 Credits (3)",
            "description": "This course offers a study of British literature from its origins in Old English to the 18th century. This survey covers specific literary works--essays, short stories, novels, poems, and plays--as well as the social, cultural, and intellectual currents that influenced the literature.",
            "link": null,
            "taughtWith": null
        },
        "2640": {
            "name": "British Literature II",
            "credits": "3 Credits (3)",
            "description": "This course offers a study of British literature from the 18th century to the present. This survey covers specific literary works--essays, short stories, novels, poems, and plays--as well as the social, cultural, and intellectual currents that influenced the literature.",
            "link": null,
            "taughtWith": null
        },
        "2650": {
            "name": "World Literature I",
            "credits": "3 Credits (3)",
            "description": "In this course, students will read representative world masterpieces from ancient, medieval and Renaissance literature. Students will broaden their understanding of literature and their knowledge of other cultures through exploration of how literature represents individuals, ideas and customs of the world cultures. The course focuses strongly on examining the ways literature and culture intersect and define each other.",
            "link": null,
            "taughtWith": null
        },
        "2996": {
            "name": "Special Topics",
            "credits": "1-3 Credits",
            "description": "Emphasis on a literary and/or writing subject chosen for the semester. Repeatable for a unlimited credit under different subtitles.",
            "link": null,
            "taughtWith": null
        }
    }
}